[
  {
    "title": "Dari Kedai Ke Rumah: Kopi Kenangan Luncurkan Kenangan Beans Untuk Hadirkan Seduhan Ala Mantan Di Rumah",
    "link": "https://kopikenangan.com/news/dari-kedai-ke-rumah-kopi-kenangan-luncurkan-kenangan-beans-untuk-hadirkan-seduhan-ala-mantan-di-rumah",
    "date": "12/11/24",
    "author": "Henrikus Andrian",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/5fa1095912d2fc6dfc63ac9c/1740458387628-CZWJDOHABNGE46GO79LD/KK-Kenangan-Beans-Website-Header.jpg",
    "content": "Kopi Kenangan tawarkan pengalaman baru bagi pelanggan untuk ciptakan cita rasa ikonik Kopi Kenangan Mantan di rumah dengan Kenangan Beans.\n\nSudah genap tujuh tahun Kopi Kenangan menyajikan kopi lokal berkualitas untuk masyarakat Indonesia melalui ratusan gerainya yang tersebar di seluruh Nusantara. Guna menjalankan misi untuk mengenalkan kopi lokal berkualitas, Kopi Kenangan tak ingin berhenti di produk minuman saja dan pada bulan Desember ini resmi meluncurkan rangkaian produk biji kopi Kenangan Beans yang bisa ditemui di gerai-gerai Kopi Kenangan terpilih.\n\nPeluncuran rangkaian produk Kenangan Beans ini memberikan kesempatan bagi para pecinta kopi untuk menikmati kualitas dan cita rasa khas Kopi Kenangan di rumah. Kenangan Beans menawarkan dua varian unggulan dengan karakter rasa yang kaya dan otentik. Archipelago Blend menghadirkan perpaduan biji kopi terbaik dari Sumatera dan Jawa, dengan kombinasi rasa aroma kacang panggang, dark chocolate, karamel, dan rempah-rempah. Sementara itu, Archipelago Reserve merupakan campuran istimewa biji kopi dari Sumatera, Flores, dan Jawa, yang menawarkan rasa unik dengan sentuhan cokelat, gula merah, cengkeh, serta kacang yang khas.\n\"Peluncuran rangkaian produk Kenangan Beans adalah langkah kami untuk membawa kehangatan dan kenangan dari kedai kopi ke rumah Para Mantan. Dengan produk ini, pelanggan dapat menikmati kopi berkualitas premium dan meracik kenangan, kapan saja dan di mana saja,\" ujar Edward Tirtanata, CEO & Co-Founder Kopi Kenangan.\nRangkaian produk Kenangan Beans kini tersedia di lebih dari 250 gerai Kopi Kenangan dan Kenangan Signature terpilih. Produk ini menjadi solusi ideal bagi mereka yang ingin menikmati momen spesial dengan kopi racikan sendiri, tanpa harus meninggalkan kenyamanan rumah. Untuk informasi lebih lanjut mengenai Kenangan Beans dan ketersediaan di gerai, kunjungi https://kopikenangan.com/kenangan-beans. "
  },
  {
    "title": "Berawal Dari Sebesar Biji Kopi, Kenali Tanda Awal Kanker Payudara Bersama Kopi Kenangan Dan Lovepink",
    "link": "https://kopikenangan.com/news/berawal-dari-sebesar-biji-kopi-kenali-tanda-awal-kanker-payudara-bersama-kopi-kenangan-dan-lovepink",
    "date": "10/28/24",
    "author": "Henrikus Andrian",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/5fa1095912d2fc6dfc63ac9c/1740458090969-6HUYCBP2E4IAZK0RQUFF/Coffee+Sleeve+Edisi+Khusus+Kolaborasi+Kopi+Kenangan+dan+Lovepink.jpg",
    "content": "Jakarta, 28 Oktober 2024 - Dalam rangka memperingati bulan Oktober sebagai Bulan Peduli Kanker Payudara, Kopi Kenangan dengan bangga mengumumkan kolaborasinya bersama Lovepink dalam acara tahunan Indonesia Goes Pink, sebuah inisiatif yang bertujuan meningkatkan kesadaran akan pentingnya deteksi dini kanker payudara. \n\nTahukah Anda, bahwa benjolan awal penyebab kanker payudara, yang menempati urutan pertama terkait jumlah kanker terbanyak serta menjadi salah satu penyumbang kematian pertama akibat kanker di Indonesia, ternyata awalnya memiliki ukuran sekecil biji kopi. Informasi ini, ditambah dengan data bahwa sekitar 43% kematian akibat kanker bisa dikurangi apabila pasien rutin melakukan deteksi dini. Inilah yang mendasari kolaborasi antara Kopi Kenangan dengan Lovepink, organisasi non-profit yang fokus pada kampanye untuk meningkatkan kesadaran akan pentingnya deteksi dini pada kanker payudara.\n\nKopi Kenangan memanfaatkan momentum acara tahunan Lovepink, “Indonesia Goes Pink” untuk memberikan nilai lebih pada masyarakat Indonesia, terutama perempuan, pecinta  kopi untuk melakukan deteksi dini kanker payudara sehingga dapat melakukan  tindakan yang tepat untuk membuat perbedaan besar serta menyelamatkan nyawa. \n\nHal ini dilakukan dengan menyediakan merchandise edisi spesial berupa coffee sleeve yang dapat dibeli khusus di booth Kopi Kenangan pada saat pelaksanaan acara Indonesia Goes Pink, yang diselenggarakan di Plaza Indonesia Jakarta tanggal 27 Oktober 2024. Coffee sleeve ini terbuat dari bahan silikon pink dengan emboss biji kopi. Kopi Kenangan berharap “pesan” ini dapat menginspirasi Para Mantan (panggilan akrab untuk pelanggan Kopi Kenangan), khususnya pelanggan perempuan, untuk lebih peduli pada kesehatan melalui pemeriksaan mandiri dan cek kesehatan rutin.\n\nDi acara Indonesia Goes Pink, pengunjung juga bisa menikmati Pink Walk, Pink Fashion Street Show, serta berbagai aktivitas interaktif di booth Kopi Kenangan.\n\n“Di Kopi Kenangan, kami percaya bahwa setiap langkah kecil dapat membawa perubahan besar. Kami sangat senang bisa bekerja sama dengan Lovepink dalam kampanye ini, karena melalui Indonesia Goes Pink, kami dapat menyebarkan pesan penting tentang deteksi dini kanker payudara kepada para pelanggan kami dan komunitas yang lebih luas. Harapan kami, setiap gelas kopi yang dinikmati dalam kampanye ini dapat mengingatkan semua orang untuk lebih peduli terhadap kesehatan mereka dan mendukung mereka yang sedang berjuang,” ujar Ananditha Mayasari, selaku Head of Marketing Kopi Kenangan.\n\nKolaborasi ini tidak hanya memperkuat pesan tentang pentingnya kesehatan tetapi juga menunjukkan komitmen Kopi Kenangan dalam menciptakan dampak positif di masyarakat melalui aksi nyata. Acara ini diharapkan dapat menjadi inspirasi bagi semua pihak untuk lebih peduli terhadap kesehatan dan berbuat kebaikan bersama."
  },
  {
    "title": "Teman Mantan Kenangan Brands Tinggalkan Kenangan Baik Di Surabaya",
    "link": "https://kopikenangan.com/news/teman-mantan-kenangan-brands-tinggalkan-kenangan-baik-di-surabaya",
    "date": "10/18/24",
    "author": "Henrikus Andrian",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/5fa1095912d2fc6dfc63ac9c/1740457979395-61J2XDYR26VO6MKM9M39/CSR+Surabaya.jpg",
    "content": "Surabaya, 18 Oktober 2024 - Sebagai bagian dari rangkaian acara Kenangan Leadership Conference, Kenangan Brands menggelar kegiatan CSR “Bersama Kenangan” dengan fokus kegiatan pada edukasi dan pemberdayaan komunitas. Kenangan Leadership Conference adalah agenda tahunan yang diselenggarakan oleh Kenangan Brands, dengan tujuan menciptakan ruang bagi semua Teman Mantan (panggilan akrab untuk karyawan Kenangan Brands) untuk mengembangkan potensi mereka dan menampilkan versi terbaik mereka di Kenangan Brands. Dalam konferensi ini, selain karyawan Kenangan Brands diajak untuk meningkatkan kompetensi melalui rangkaian pelatihan, juga diadakan kompetisi Kenangan Barista Championship, yang ditutup dengan kegiatan CSR sebagai implementasi dari penerapan nilai-nilai keberlanjutan dan tanggung jawab sosial Kenangan Brands. \n\nPada kegiatan tahun ini yang diselenggarakan di Kota Pahlawan, Kenangan Brands menggandeng Bell Living Lab sebagai mitra untuk memberikan wawasan baru mengenai daur ulang limbah kopi, sekaligus mengadakan workshop kreatif menjahit kulit vegan berbahan dasar limbah kopi.\n\nBell Living Lab adalah sebuah perusahaan berbasis riset yang mengembangkan dan memproduksi biomaterial berbahan dasar limbah kopi. Bell Living Lab menyediakan wadah sebagai ekosistem kolaboratif antara peneliti, industri, dan komunitas untuk menguji, memvalidasi, dan mempercepat adopsi inovasi daur ulang dalam lingkungan nyata.\n\nSelain workshop, peserta juga berkesempatan mengikuti talk show untuk mendapatkan wawasan mengenai berbagai potensi inovatif dari limbah kopi—mulai dari bahan tekstil hingga material furnitur ramah lingkungan—yang dapat diolah oleh Bell Living Lab. Dalam kegiatan workshop ini, peserta diajak menjahit kulit vegan yang terbuat dari limbah kopi. Karya-karya hasil workshop ini kemudian dijual, dan berhasil mengumpulkan dana sebesar Rp10.000.000. Melihat antusiasme karyawan dalam memberikan donasi, perusahaan turut berpartisipasi dengan menambah jumlah donasi hingga total dana yang terkumpul sebanyak Rp50.000.000.\n\nDana tersebut, bersama dengan sumbangan dari sponsor acara berupa 1.400 kotak susu dari Greenfields dan 1.000 bungkus cookies dari Prima Food Solutions, kemudian diterima oleh perwakilan 5 panti asuhan di Surabaya serta FoodCycle Indonesia, yang akan mendistribusikan bantuan tersebut kepada anak-anak kurang beruntung di berbagai titik di kota Surabaya.\n\n\"Kenangan Brands ingin memberikan dampak yang lebih dari sekadar produk kami. Melalui kegiatan CSR ini, kami berharap dapat meninggalkan kenangan yang baik di kota tempat kami menyelenggarakan acara tahunan Kenangan Leadership Conference,\" ujar Inneke Lestari, selaku Head of Legal and Corporate Affairs Kenangan Brands.\n\nKegiatan CSR ini merupakan salah satu langkah nyata Kenangan Brands untuk mengintegrasikan praktik sustainability dan tanggung jawab sosial dalam setiap aspek bisnisnya.\n\nFoto dokumentasi kegiatan bisa diakses di tautan ini."
  },
  {
    "title": "Genap Berusia 7 Tahun, Kopi Kenangan Umumkan Pencapaian Dan Rencana Ekspansi Internasional Selanjutnya",
    "link": "https://kopikenangan.com/news/genap-berusia-7-tahun-kopi-kenangan-umumkan-pencapaian-dan-rencana-ekspansi-internasional-selanjutnya",
    "date": "8/27/24",
    "author": "Marketing Creative",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/5fa1095912d2fc6dfc63ac9c/1725366393764-W8S3VB3N1VCA3IIDV0R7/Edward+Tirtanata%2C+Group+CEO+and+Co-Founder+of+Kopi+Kenangan.jpeg",
    "content": "Setelah sukses hadirkan cita rasa kopi Indonesia di tiga negara selama tujuh tahun, Kopi Kenangan segera buka gerai pertamanya di Filipina serta India.\n\n\nJakarta, 27 Agustus 2024 - Bulan Agustus menjadi bulan yang sangat spesial untuk peritel kopi terkemuka di Indonesia, Kopi Kenangan. Pasalnya, di bulan ini Kopi Kenangan genap menginjak usianya yang ketujuh. Perjalanan selama tujuh tahun diwarnai dengan berbagai tonggak prestasi baik di dalam negeri maupun di panggung internasional. \nKopi Kenangan mengawali perjalanannya di tahun 2017 dengan sebuah gerai kecil di Menara Standard Chartered yang dimodali sendiri oleh Edward Tirtanata, James Prananto, dan Cynthia Chaerunnisa. Setelah berhasil mendapatkan pendanaan awal di tahun 2018, Kopi Kenangan mulai giat melakukan ekspansi gerainya di Indonesia dan resmi mengukuhkan statusnya sebagai salah satu pemain utama di pasar kopi fresh-brew di Indonesia. Di tahun 2019, Kopi Kenangan berhasil mendapatkan pendanaan Seri A, di mana penyanyi rap Jay-Z serta petenis dunia Serena Williams turut berinvestasi di Kopi Kenangan. Meski dilanda wabah pandemi Covid-19 pada tahun 2020, Kopi Kenangan terus melakukan ekspansi dengan melakukan pengalihan strategi ekspansi, yang sebelumnya difokuskan ke area Central Business District (CBD) menjadi ke area residensial semenjak diberlakukannya PPKM (Pemberlakuan Pembatasan Kegiatan Masyarakat). Kopi Kenangan menutup 2020 dengan pertumbuhan gerai lebih dari dua kali lipat dari tahun sebelumnya. Tahun 2021 Kopi Kenangan resmi memperoleh status New Retail F&B Unicorn pertama se-Asia Tenggara setelah memperoleh pendanaan Seri C. Tak berhenti di situ, tahun 2022, Kopi Kenangan mewujudkan visinya untuk memperkenalkan kopi Indonesia sebagai sebuah brand, dan bukan hanya sekadar komoditas dengan melebarkan sayap ke kancah internasional dan membuka gerai pertama di Malaysia, dilanjutkan dengan Singapura pada 2023.\n“Sepak terjang tujuh tahun Kopi Kenangan di Indonesia telah berhasil menghadirkan lebih dari 900 gerai. Guna mewujudkan visi untuk menghadirkan kopi lokal berkualitas untuk seluruh lapisan masyarakat, kami menargetkan untuk memiliki 2000 gerai Kenangan Brands di Indonesia pada tahun 2027,” kata Edward Tirtanata, Group CEO and Co-Founder of Kopi Kenangan.\nSimak perjalanan tujuh tahun Kopi Kenangan pada gambar berikut.\nMeski baru berjalan setengah tahun di 2024, Kopi Kenangan sudah mampu menunjukkan performa finansial yang melampaui tahun sebelumnya. Dibandingkan dengan kuartal II tahun 2023, pada kuartal II tahun ini angka penjualan Kopi Kenangan mengalami kenaikan sebesar 27%. Dengan menggunakan perbandingan yang sama, performa EBITDA Kopi Kenangan juga mengalami pertumbuhan sebesar dua kali lipat dibanding kuartal II tahun lalu. Pada kuartal II tahun 2024, Kopi Kenangan berhasil mencatatkan EBITDA margin sebesar 23% dan margin keuntungan bersih (net profit) sebesar 5%.\nTidak hanya itu, Kopi Kenangan juga berhasil meraih performa penjualan produk baru tertinggi di tahun 2023 dan 2024, melalui rangkaian produk dari Matcha Series yang sukses terjual lebih dari 940.000 gelas hanya dalam waktu dua bulan dan rangkaian produk O.G Aren Series yang sudah terjual lebih dari 890.000 gelas dalam waktu dua bulan.\nMelihat peningkatan tren penggunaan aplikasi di industri F&B, aplikasi Kopi Kenangan semakin marak digunakan oleh Para Mantan, panggilan untuk pelanggan setia Kopi Kenangan. Dengan layanan penjadwalan pick up, delivery, serta loyalty member yang menawarkan berbagai macam promo menarik, penjualan melalui aplikasi Kopi Kenangan mengalami pertumbuhan yang stabil setiap tahunnya.\nPencapaian Kenangan Coffee di Malaysia dan Singapura\nSudah hampir genap dua tahun sejak ekspansi internasional Kopi Kenangan yang pertama kali ke Malaysia. Kilas balik ke hari pertama peluncuran gerai perdana Kenangan Coffee di Suria KLCC yang berhasil menjual lebih dari 1.440 gelas, hingga kini, per Juni 2024 Kenangan Coffee Malaysia sudah memiliki lebih dari 48 gerai di 5 negara bagian. Tak hanya Kopi Kenangan Indonesia yang berhasil meraih performa penjualan yang baik, Kenangan Coffee Malaysia turut mencetak pertumbuhan penjualan lebih dari 360% di kuartal II 2024. Pertumbuhan yang pesat ini didorong oleh pembukaan toko dan Same Store Sales Growth (SSSG) yang kuat. Dengan performa penjualan yang menjanjikan di semester pertama 2024, Kenangan Coffee Malaysia menargetkan untuk menutup tahun 2024 dengan total 100 gerai di Malaysia.\nTidak lupa dengan Kenangan Coffee Singapura yang pada hari pertama peluncurannya di tahun 2023 berhasil menjual lebih dari 1.500 gelas. Meski belum genap berusia satu tahun, Kenangan Coffee Singapura berhasil meraih pertumbuhan margin EBITDA sebesar 17% di kuartal II tahun ini. Angka penjualan di kuartal II 2024 juga mengalami kenaikan sebesar 43% dari kuartal I 2024. Kenangan Coffee Singapura saat ini memiliki 7 gerai dan menargetkan penambahan 1 gerai lagi sampai akhir 2024.\n\nJordan Lung selaku General Management Kenangan Coffee Malaysia & Singapore turut bangga menyampaikan pencapaian yang sudah diraih Kenangan Coffee selama dua tahun terakhir, “Dalam dua tahun sejak ekspansi internasional pertama kami, Kenangan Coffee telah membuktikan diri sebagai salah satu pemain utama di pasar Asia Tenggara, dengan pertumbuhan signifikan di Malaysia dan Singapura. Pencapaian luar biasa ini tidak hanya mencerminkan kekuatan merek kami, tetapi juga memberikan keyakinan bahwa kami berada di jalur yang tepat untuk terus berkembang.”\n\nEkspansi Kenangan Coffee ke Filipina dan India\nPada perayaan HARMANAS ke-7 ini, Kopi Kenangan juga resmi mengumumkan ekspansi internasional ke negara ketiga dan keempat yaitu Filipina dan India. Sama seperti Malaysia dan Singapura, kedua negara ini juga akan beroperasi di bawah nama merek internasional Kenangan Coffee. Kopi Kenangan berharap dapat mempercepat perjalanan ekspansi globalnya melalui strategi lisensi bisnis dengan pemain F&B lokal di negara yang dituju.\nFilipina menjadi negara ketiga di Asia Tenggara yang akan disambangi oleh Kenangan Coffee. Memiliki selera kudapan manis yang mirip dengan Indonesia, Filipina menjadi langkah ekspansi yang tepat. Di kalangan generasi muda, yang merupakan pelanggan utama Kopi Kenangan dan Kenangan Coffee, popularitas kopi fresh brew semakin meningkat, terutama es kopi.  Dari tahun 2021 hingga 2023, penjualan kopi di Filipina tumbuh dengan Compound Annual Growth Rate (CAGR) lebih dari 20%.\nAwal tahun 2025 akan menjadi langkah pertama Kopi Kenangan untuk melakukan ekspansi ke negara di luar Asia Tenggara, yaitu India. Konsumsi kopi di India sedang naik daun di kalangan Gen Z dan Millennials. Pertumbuhan ini juga dicerminkan dengan pertumbuhan penjualan chained cafes di India pada tahun 2020-2022 yang mencapai 29%. Ekspektasi pertumbuhan pasar cafe juga diprediksi akan meningkat 19-21% dalam kurun waktu 5 tahun ke depan.\n\"Di ulang tahun ke-7 Kopi Kenangan, kami merayakan perjalanan luar biasa yang telah membawa kami dari sebuah kedai kecil di Indonesia ke panggung internasional. Ekspansi kami ke Malaysia dan Singapura adalah bukti komitmen kami untuk menyajikan kopi berkualitas kepada lebih banyak orang di seluruh dunia. Ke depan, harapan kami adalah terus memperluas jangkauan dengan membuka 500 gerai internasional Kenangan Coffee yang akan tersebar di berbagai negara,\" ucap Edward.\nDi samping peremajaan bangunan SDN 5 Bojong, Kenangan Brands (Kopi Kenangan) bersama Yayasan 1000 Guru hadir di tengah para siswa dan guru untuk melakukan berbagai aktivitas seru. 1000 Guru berhasil mengajak 32 volunteer untuk mengajar dan bermain dengan para siswa sebagai bagian dari aktivitas. Dihadiri oleh 67 siswa SDN 5 Bojong, 1000 Guru membawakan materi bertema kesenian dan ditutup dengan kegiatan seru bersama seluruh siswa.\nInilah berbagai keseruan Kenangan Brands (Kopi Kenangan) dan 1000 Guru dalam menyambut Hari Pendidikan Nasional 2024 di Desa Bojong, Garut, Jawa Barat. Perusahaan berharap seluruh rangkaian kegiatan dan bantuan yang diberikan oleh Kenangan Brands (Kopi Kenangan) maupun Yayasan 1000 Guru dapat bermanfaat bagi para siswa, guru, dan juga masyarakat sekitar.\n\nTentang Kenangan Brands\nKenangan Brands adalah grup F&B berkonsep New Retail dengan pertumbuhan tercepat di Indonesia. Didirikan pada tahun 2017 dengan merek andalannya, Kopi Kenangan. Pada tahun 2020, Kenangan Brands mulai merambah ke kategori makanan seperti roti dan soft-baked cookies, dan juga Chigo x Flip yang menyajikan makanan gurih seperti fried chicken dan burger. Pada tahun 2022, kami meluncurkan inovasi terbaru kami dengan memasuki pasar FMCG melalui peluncuran produk Ready to Drink Kopi Kenangan Hanya Untukmu, Kopi Siap Minum dalam kemasan, sebagai usaha untuk mengembangkan dan memperluas pasar secara nasional, sekaligus menjawab tingginya antusias pelanggan terhadap Kopi Kenangan. Melalui pemahaman dan eksplorasi cita rasa lokal serta model online dan offline ‘ritel baru’ yang berfokus pada pengalaman pelanggan, Kenangan Brands memiliki visi untuk menjadi bisnis makanan dan minuman terbesar di Indonesia dan Asia Tenggara, dengan produk berkualitas terjangkau, cepat dan pelayanan yang ramah, quality control, dan pengembangan usaha kreatif.\n\nNarahubung Media Kenangan Brands:\nRuth Davina\nCorporate Affairs Manager, Kenangan Brands\nruth.davina@kopikenangan.com\ncorporateaffairs.dept@kopikenangan.com\n\n1 Euromonitor International 2024 | Cafe/Bars in the Philippines\n2 Euromonitor International 2024 | Cafe/Bars in India\n3 CRISIL MI&A Research"
  },
  {
    "title": "Kolaborasi Dengan Komikus Lokal, Kopi Kenangan Hadirkan Bajak Laut Bertopi Jerami Di Gerainya",
    "link": "https://kopikenangan.com/news/kolaborasi-dengan-komikus-lokal-kopi-kenangan-hadirkan-bajak-laut-bertopi-jerami-di-gerainya",
    "date": "6/26/24",
    "author": "Henrikus Andrian",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/5fa1095912d2fc6dfc63ac9c/1740457838205-M1WK3Y7590FX3L7XRQWY/Petualangan+Rasa+Kopi+Kenangan+x+One+Piece+x+Tahilalats.jpeg",
    "content": "Jakarta, 26 Juni 2024 - Kopi Kenangan dengan bangga mengumumkan kolaborasi eksklusif dengan serial animasi legendaris, One Piece dan ilustrator komik terkenal, Tahilalats. Kolaborasi unik ini merupakan bagian dari perayaan ulang tahun ke-25 One Piece dan untuk merayakannya bersama seluruh penggemar di Indonesia, Kopi Kenangan menghadirkan menu minuman dengan cita rasa buah-buahan segar yang dilengkapi dengan kemasan edisi khusus One Piece dan Tahilalats. \n\nPeluncuran kolaborasi Kopi Kenangan dengan One Piece dan Tahilalats ini menghadirkan tiga varian menu minuman dan tiga varian makanan yang akan membawa Para Mantan dalam Petualangan Rasa yang unik. Menu minuman Petualangan Rasa ini terdiri dari Captain Apple Cream,  Sunny Peach Americano,  dan Master Chef Peach Aren Latte.\nMenu minuman spesial ini menawarkan berbagai pengalaman cita rasa yang bisa dipilih untuk menemani setiap momen petualangan Para Mantan. Captain Apple Cream cocok bagi mereka yang ingin merasakan kesegaran kombinasi buah apel dan black tea. Bagi pelanggan yang mencari sensasi petualangan rasa yang unik bisa menikmati Sunny Peach Americano dengan kesegaran buah peach. Tak lupa juga, untuk penggemar kopi bisa menikmati kombinasi kopi gula aren dengan peach syrup di menu Master Chef Peach Aren Latte.\n\nSetiap minuman dalam kolaborasi ini akan disajikan dengan sleeve eksklusif yang menampilkan desain karakter One Piece dengan sentuhan artstyle khas Tahilalats. Tak lupa juga, para penggemar anime legendaris ini dapat menemukan berbagai macam merchandise yang bisa dikumpulkan sebagai collectible item seperti tumbler dan totebag di seluruh gerai Kopi Kenangan.\nUntuk menemani pelanggan dalam perjalanan petualangan rasa ini, tidak lengkap rasanya jika tidak ditemani dengan makanan ringan. Kolaborasi ini juga menghadirkan menu makanan ringan yaitu Red Apple Cream, Matcha Bun, Smoked Chicken Cheese Bread.\n\nGroup CEO Kenangan Brands, Edward Tirtanata, menyatakan, \"Kami sangat senang dapat bekerja sama dengan One Piece dan Tahilalats, dua ikon dalam dunia Animation dan Web Comic. Kolaborasi ini adalah perwujudan dari komitmen Kopi Kenangan untuk selalu menghadirkan inovasi produk melalui kolaborasi dengan industri kreatif. Kami berharap para penggemar dapat menikmati perjalanan petualangan rasa yang seru bersama Kopi Kenangan, One Piece, dan Tahilalats.\"\nSebagai salah satu konsumen setia Kopi Kenangan, Rakhman Azhari selaku Co-Founder Mindblowon Studio (Tahilalats) merasa sangat bangga dan senang kolaborasi ini akhirnya bisa berjalan. “Saya harap kolaborasi ini juga bisa memberikan sesuatu yang spesial bagi para fans dan juga  pelanggan setia Kopi Kenangan. Tidak ketinggalan saya juga ingin mengucapkan terima kasih untuk Kopi Kenangan atas kepercayaannya dalam kolaborasi bersama ONE PIECE dan Tahilalats! Let’s sail together,” ujar Rakhman.\n\nMenu kolaborasi ini sudah dapat ditemui di seluruh gerai Kopi Kenangan. Jangan lewatkan kesempatan untuk merasakan petualangan rasa yang epik dalam setiap tegukan!\nUntuk informasi lebih lanjut, silakan kunjungi website resmi Kopi Kenangan di www.kopikenangan.com atau ikuti media sosial kami di Instagram, Facebook, dan Twitter @kopikenangan.id.\n\nFoto pendukung siaran pers ini dapat diakses pada tautan berikut"
  },
  {
    "title": "Bonjour! Memperkenalkan Kenangan Boulangerie, Yang Terbaru Dari Kenangan Brands",
    "link": "https://kopikenangan.com/news/bonjour-memperkenalkan-kenangan-boulangerie-yang-terbaru-dari-kenangan-brands",
    "date": "6/5/24",
    "author": "Marketing Creative",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/5fa1095912d2fc6dfc63ac9c/1725265879150-2X8WSS8OHEP18D2DDHQ1/Screen+Shot+2024-09-02+at+15.26.08.png",
    "content": "Kenangan Boulangerie hadir menyajikan roti-roti yang dibuat dengan metode tradisional Prancis dan dipadukan dengan cita rasa khas Asia.\n\n\nJakarta, 5 Juni 2023 - Croissant dengan mentega mungkin sudah umum tersedia di Jakarta. Namun, bagaimana dengan Croissant yang berisikan saus telur asin yang khas? Inilah sajian-sajian yang dihadirkan oleh brand terbaru dari Kenangan Brands, yaitu Kenangan Boulangerie. Roti yang dibuat dengan teknik tradisional asli Prancis dipadukan dengan cita rasa khas Asia yang dikenal oleh orang Indonesia. Setiap produk Kenangan Boulangerie diciptakan secara khusus oleh Thomas Meneau, seorang chef bertalenta dan berpengalaman yang sudah menekuni dunia baking hampir 10 tahun di berbagai benua. \n“Kenangan Boulangerie adalah hidangan baru sekaligus bukti dari keseriusan Kenangan Brands dalam industri F&B di Indonesia. Kami terus berusaha untuk mengakomodasi keinginan konsumen akan inovasi-inovasi menu yang unik,” kata Edward Tirtanata, Group CEO of Kenangan Brands. “Kami juga melibatkan chef Thomas Meneau, chef asal Prancis, untuk mengawasi sekaligus mengembangkan produk-produk terbaik bersama dengan tim Research and Development Kenangan Brands.”\nKenangan Boulangerie resmi diluncurkan pada hari Rabu, 5 Juni 2024 di Kenangan Heritage, Senayan City dan secara bertahap di seluruh store Kenangan Signature di Indonesia. Melalui Kenangan Boulangerie, Kenangan Brands ingin menghadirkan produk roti berkualitas tinggi dan enak untuk dinikmati bersama minuman kopi favorit para konsumen.\nDari pilihan croissant sampe roti brioche, inilah beberapa produk andalan Kenangan Boulangerie:\nBrioche au Craquelin (Matcha, Ube, dan Creamy)\nAlmond Croissant Pralinette\nLobster Tail Pistachio Chocolate\nIlustrasi dari produk andalan Kenangan Boulangerie\nSeluruh menu yang tersedia di Kenangan Boulangerie diracik dan dikembangkan oleh Chef Thomas Meneau bersama dengan tim R&D Kenangan Brands. Secara total, Kenangan Boulangerie memiliki 17 pilihan menu yang semua dibuat secara personal dan dikurasi untuk kepuasan pelanggan. “Tidak ada hal yang lebih menarik daripada menjelajahi keunikan citarasa di berbagai belahan dunia. Inilah yang menjadi inspirasi dari setiap pilihan menu yang saya sajikan di Kenangan Boulangerie,” kata Thomas Meneau, Executive Chef of Kenangan Brands. Ia melanjutkan, “Saya harap, para pelanggan dapat menikmati setiap roti di Kenangan Brands dan merasakan keunikannya ketika citarasa Asia dipadu dengan makanan yang berasal dari Eropa, khususnya tanah air saya, Prancis.”\nProfil Thomas Meneau - Executive Chef of Kenangan Brands\nThomas Meneau adalah seorang Chef berketurunan Prancis yang sudah menekuni bidang bakery selama hampir 10 tahun. Dari awal berkarir di Prancis, kemudian Asia Pasifik (Hongkong & Tiongkok), sampai di Asia Tenggara (Filipina, Singapura & Indonesia)*, Chef Thomas selalu menjelajahi cita rasa di setiap negara yang ia kunjungi.\nSebagai Executive Chef of Kenangan Brands, Chef Thomas berperan sebagai kepala dari pengembangan produk, prosedur penghidangan, dan inovasi menu. Seluruh produk yang disajikan telah dikurasi secara saksama, guna untuk mencapai tujuan utamanya, yaitu membuat produk-produk yang dicintai oleh para penggemar roti di Indonesia.\n*Untuk mengetahui perjalanan karir Chef Thomas lebih lanjut, silakan untuk menghubungi tim Corporate Affairs Kenangan Brands.\n\nTentang Kenangan Brands\nKenangan Brands adalah grup F&B berkonsep New Retail dengan pertumbuhan tercepat di Indonesia. Didirikan pada tahun 2017 dengan merek andalannya, Kopi Kenangan. Pada tahun 2020, Kenangan Brands mulai merambah ke kategori makanan seperti roti dan soft-baked cookies, dan juga Chigo x Flip yang menyajikan makanan gurih seperti fried chicken dan burger. Pada tahun 2022, kami meluncurkan inovasi terbaru kami dengan memasuki pasar FMCG melalui peluncuran produk Ready to Drink Kopi Kenangan Hanya Untukmu, Kopi Siap Minum dalam kemasan, sebagai usaha untuk mengembangkan dan memperluas pasar secara nasional, sekaligus menjawab tingginya antusias pelanggan terhadap Kopi Kenangan. Melalui pemahaman dan eksplorasi cita rasa lokal serta model online dan offline ‘ritel baru’ yang berfokus pada pengalaman pelanggan, Kenangan Brands memiliki visi untuk menjadi bisnis makanan dan minuman terbesar di Indonesia dan Asia Tenggara, dengan produk berkualitas terjangkau, cepat dan pelayanan yang ramah, quality control, dan pengembangan usaha kreatif.\n\nNarahubung Media Kenangan Brands:\nRuth Davina\nCorporate Affairs Manager, Kenangan Brands\nruth.davina@kopikenangan.com\ncorporateaffairs.dept@kopikenangan.com"
  },
  {
    "title": "",
    "link": "https://kopikenangan.com/news/hari-pendidikan-nasional-2024-kopi-kenangan-bersama-yayasan-1000-guru-mengunjungi-garut-jawa-barat",
    "date": "",
    "author": "Marketing Creative",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/5fa1095912d2fc6dfc63ac9c/1725264341760-959YDA6IZXJDZTZHYVO2/Screen+Shot+2024-09-02+at+13.59.38.png",
    "content": "Kopi Kenangan Bersama Yayasan 1000 Guru Mengunjungi Desa Bojong untuk Peremajaan Sekolah Sekaligus Berinteraksi dengan Murid-Murid di SDN 5 Bojong, Garut.\n\n\nJakarta, 6 Mei 2024 - Siapa yang tidak mengenal sosok Ki Hadjar Dewantara? Bapak Pendidikan Nasional yang jasa-jasanya selalu kita kenang setiap tanggal 2 Mei sebagai Hari Pendidikan Nasional (HARDIKNAS). Bertepatan dengan HARDIKNAS 2024, sekaligus sebagai upaya perusahaan dalam menjalankan program kontribusi sosial di bawah payung kontribusi sosial Kenangan Baik. Kenangan Brands (Kopi Kenangan), memberikan bantuan melalui asosiasi petani gula aren di Garut, Jawa Barat. Kontribusi ini berupa peremajaan sarana edukasi SDN 5 Bojong untuk meningkatkan kenyamanan para murid saat kegiatan belajar mengajar (KBM). \nBantuan kepada asosiasi petani gula aren, yang merupakan salah satu pemasok Kenangan Brands merupakan salah satu program Kenangan Baik, tepatnya, di bawah pilar Kenangan Berdaya, yaitu pilar yang menaungi berbagai program yang berhubungan dengan pemberdayaan komunitas petani ataupun pemasok lokal lainnya; serta pilar Kenangan PinTer (Pintar dan Terampil), yaitu pilar yang menaungi seluruh program yang bertujuan untuk mencerdaskan dan meningkatkan keahlian, keterampilan serta pengetahuan masyarakat.\nSelain memberikan bantuan peremajaan bangunan sekolah, pembangunan fasilitas (seperti toilet dan lapangan), serta renovasi kelas, Kenangan Brands juga bekerja sama dengan 1000 Guru Foundation, yayasan dan komunitas yang bergerak di bidang edukasi, untuk mengadakan kegiatan belajar mengajar di SDN 5 di Desa Bojong, Garut. Kegiatan edukasi ini dilaksanakan dengan penuh keceriaan dan keseruan yang juga diikuti oleh guru dari SDN 5 Bojong.\nPemberian Plakat Penghargaan dari Perwakilan Asosiasi Petani Gula Aren dan Kepala Sekolah Desa Bojong kepada Kenangan Brands (Kopi Kenangan) di SDN 5 Bojong.\n“Kami selalu berusaha memberikan kontribusi yang berarti tidak hanya kepada pelanggan dan masyarakat umum, tapi juga kepada para supplier kami. Melalui program Kenangan Baik, kami akan terus memperluas dampak positif terhadap lingkungan dan sosial kepada seluruh pemangku kepentingan Kenangan Brands, terutama ekosistem supply chain,” kata Edward Tirtanata, Group CEO Kenangan Brands. “Saya berharap, kontribusi ini dapat diterima dengan baik dan bermanfaat bagi masyarakat sekitar Desa Bojong.”\n\nAwal Perjalanan Kopi Kenangan di Desa Bojong 2023\nTahun 2023 menjadi tahun pertama perusahaan memberikan kontribusi di Desa Bojong. Saat itu, perusahaan mendapatkan informasi bahwa petani gula aren di Desa Bojong membutuhkan berbagai kebutuhan untuk menunjang produktivitas mereka. Setelah mendapatkan informasi dan melakukan survei ke lapangan, perusahaan langsung memberikan sejumlah bantuan berupa peralatan panen dan masak, 3 unit fasilitas MCK (Mandi, Cuci, dan Kakus), dan 2 unit pembuatan sumur bor untuk air bersih.\nKontribusi yang dilakukan oleh Kenangan Brands (Kopi Kenangan) di Desa Bojong, Garut, Jawa Barat melalui perwakilan dari Arum Gula (Asosiasi Petani Gula Aren Desa Bojong) pada tahun 2023.\nPerjalanan di Desa Bojong Terus Berlanjut 2024\nTahun 2024, perusahaan kembali ke Desa Bojong dan kali ini, Kopi Kenangan menyasar ke salah satu sekolah dasar di Desa Bojong, yaitu SDN 5 Bojong. SDN 5 Bojong memiliki 67 siswa, 8 guru, dan 1 kepala sekolah, dan kebanyakan dari siswa di SDN 5 Bojong memiliki orang tua yang bekerja sebagai petani gula aren. Karena beberapa kondisi fasilitas di SDN 5 Bojong yang mulai kurang terjaga, perusahaan berinisiatif untuk melakukan peremajaan di beberapa area:\nDi samping peremajaan bangunan SDN 5 Bojong, Kenangan Brands (Kopi Kenangan) bersama Yayasan 1000 Guru hadir di tengah para siswa dan guru untuk melakukan berbagai aktivitas seru. 1000 Guru berhasil mengajak 32 volunteer untuk mengajar dan bermain dengan para siswa sebagai bagian dari aktivitas. Dihadiri oleh 67 siswa SDN 5 Bojong, 1000 Guru membawakan materi bertema kesenian dan ditutup dengan kegiatan seru bersama seluruh siswa.\nPara siswi sedang bereksperimen dengan warna.\nAktivitas seru antara Kenangan Brands, Yayasan 1000 Guru, dan juga para siswa.\nInilah berbagai keseruan Kenangan Brands (Kopi Kenangan) dan 1000 Guru dalam menyambut Hari Pendidikan Nasional 2024 di Desa Bojong, Garut, Jawa Barat. Perusahaan berharap seluruh rangkaian kegiatan dan bantuan yang diberikan oleh Kenangan Brands (Kopi Kenangan) maupun Yayasan 1000 Guru dapat bermanfaat bagi para siswa, guru, dan juga masyarakat sekitar.\n\nKomitmen Berkelanjutan dari Kenangan Brands (Kopi Kenangan)\nKami berkomitmen tidak hanya akan memberikan makanan dan minuman berkualitas bagi seluruh pelanggan setia di Indonesia, tapi juga membawa dampak positif semaksimal kemampuan perusahaan. Kami berharap, cerita singkat ini dapat memberikan gambaran bahwa setiap gelas kopi yang dinikmati oleh para pelanggan juga memiliki dampak positif yang selalu mengikuti. Ke depannya, perusahaan akan terus memperluas komitmen berkelanjutan seiring dengan berkembangnya perusahaan, terutama bagi ekosistem supply chain.\n\nTentang Kenangan Brands\nKenangan Brands adalah grup F&B berkonsep New Retail dengan pertumbuhan tercepat di Indonesia. Didirikan pada tahun 2017 dengan merek andalannya, Kopi Kenangan. Pada tahun 2020, Kenangan Brands mulai merambah ke kategori makanan seperti roti dan soft-baked cookies, dan juga Chigo x Flip yang menyajikan makanan gurih seperti fried chicken dan burger. Pada tahun 2022, kami meluncurkan inovasi terbaru kami dengan memasuki pasar FMCG melalui peluncuran produk Ready to Drink Kopi Kenangan Hanya Untukmu, Kopi Siap Minum dalam kemasan, sebagai usaha untuk mengembangkan dan memperluas pasar secara nasional, sekaligus menjawab tingginya antusias pelanggan terhadap Kopi Kenangan. Melalui pemahaman dan eksplorasi cita rasa lokal serta model online dan offline ‘ritel baru’ yang berfokus pada pengalaman pelanggan, Kenangan Brands memiliki visi untuk menjadi bisnis makanan dan minuman terbesar di Indonesia dan Asia Tenggara, dengan produk berkualitas terjangkau, cepat dan pelayanan yang ramah, quality control, dan pengembangan usaha kreatif.\n\nNarahubung Media Kenangan Brands:\nRuth Davina\nCorporate Affairs Manager, Kenangan Brands\nruth.davina@kopikenangan.com\ncorporateaffairs.dept@kopikenangan.com"
  },
  {
    "title": "",
    "link": "https://kopikenangan.com/news/satu-nusa-satu-bangsa-satu-kenangan-kenangan-brands-hadirkan-kopi-bergaya-italian-roast-yang-terjangkau-dengan-peluang-kemitraan",
    "date": "",
    "author": "Marketing Creative",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/5fa1095912d2fc6dfc63ac9c/1714989243557-R9O1ABTLEOWFJFI29SDU/Gerai+Pertama+Satu+Kenangan.jpg",
    "content": "Setelah 6 tahun hadir di Indonesia, Kenangan Brands hadirkan Satu Kenangan dalam rangka memperluas jangkauan pasar dan memenuhi permintaan masyarakat terhadap produk F&B dengan harga yang ekonomis.\nJakarta, 2 Mei 2024 – Dalam sebuah langkah inovatif untuk meredefinisi pengalaman menikmati kopi di Indonesia, Kenangan Brands, perusahaan Unicorn F&B New Retail pertama di Asia Tenggara, pada hari ini resmi meluncurkan lini bisnis barunya, \"Satu Kenangan\". Berangkat dari kesuksesan Kopi Kenangan, Satu Kenangan hadir sebagai merek kopi fresh brew yang diolah dengan gaya Italian Roast. Dengan harga lebih ramah di kantong, Satu Kenangan ditujukan sebagai minuman untuk semua sehingga dapat menjangkau pasar konsumen yang lebih luas. \nDiharapkan dapat menjadi solusi bagi pecinta kopi Indonesia yang menginginkan kopi dengan harga lebih ekonomis, Satu Kenangan menggunakan biji kopi pilihan dari berbagai daerah di Indonesia. Diproses dengan metode Italian Roast, yaitu teknik khusus dalam memanggang biji kopi untuk menghasilkan kopi dengan rasa kuat, serta memiliki paduan rasa manis smokey, Satu Kenangan adalah pilihan bagi para pecinta kopi yang menyukai kopi dengan cita rasa kaya serta intens. \n\"Satu Kenangan tidak hanya sekedar tentang kopi. Ini adalah manifestasi dari slogan kami: Satu Nusa, Satu Bangsa, Satu Kenangan. Kami percaya bahwa setiap orang Indonesia berhak menikmati kopi fresh brew tanpa harus menguras kantong. Dengan mengadopsi metode Italian Roast, kami memadukan kekayaan rasa kopi Nusantara dengan teknik pengolahan berlevel internasional dan membuatnya dapat dinikmati oleh semua lapisan masyarakat,” kata Edward Tirtanata, Co-Founder dan Group CEO Kenangan Brands. \nSebagai salah satu strategi untuk mempercepat ekspansi dan mempermudah konsumen di seluruh penjuru nusantara untuk mendapatkan produk kopi asli Indonesia, Kenangan Brands membuka kesempatan kemitraan untuk jenama Satu Kenangan ini. Satu Kenangan ingin mengajak para pengusaha yang memiliki ketertarikan di bidang kopi untuk bergabung menjadi bagian dari merek kopi dengan pertumbuhan tercepat di Indonesia. Para mitra akan mendapatkan kesempatan untuk membuka gerai Satu Kenangan di kota yang belum terjangkau sebelumnya, peluang untuk mengelola operasional gerai tersebut, dan memanfaatkan pasar kopi yang berkembang pesat.\n\"Kami percaya pada kekuatan kolaborasi dan kesuksesan bersama. Membuka pintu untuk kemitraan adalah langkah yang baru bagi Kopi Kenangan, dan kami sangat antusias untuk menyambut para calon mitra yang memiliki passion di dunia perkopian,\" kata Edward. \nUntuk informasi lebih lengkap terkait program kemitraan ini, silakan menghubungi kemitraan@kopikenangan.com.\nNarahubung Media: \nRuth Davina \nCorporate Affairs Manager, Kopi Kenangan \nruth.davina@kopikenangan.com"
  },
  {
    "title": "",
    "link": "https://kopikenangan.com/news/kopi-kenangan-hadirkan-menu-blewah-mewah",
    "date": "",
    "author": "Marketing Creative",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/5fa1095912d2fc6dfc63ac9c/1714988678002-6FK66ZGX8H0YC0XO7UVM/Rangkaian+Produk+Seri+Blewah+Mewah+dari+Kopi+Kenangan+%281%29.jpg",
    "content": "Marhaban ya Ramadhan, Kopi Kenangan hadirkan seri Blewah Mewah untuk menemani Para Mantan di bulan suci Ramadan\nJakarta, 19 Maret 2024 – Dalam suasana penuh suka cita menyambut bulan Ramadan yang penuh berkah, Kopi Kenangan dengan bangga memperkenalkan inovasi menu terbarunya, Blewah Mewah. Seri minuman yang memadukan kelezatan buah blewah dengan cita rasa kopi khas Kopi Kenangan, menghadirkan kesegaran untuk menemani momen berbuka puasa. Dengan kombinasi cita rasa yang unik, Blewah Mewah siap menyambut Para Mantan, panggilan sayang untuk penggemar Kopi Kenangan, dalam momen Ramadan kali ini.\nKeunikan seri Blewah Mewah ini menyajikan kesegaran buah blewah dalam menu-menu minuman favorit di Kopi Kenangan. Menu andalan Blewah Tea dengan taburan Blewah Jelly yang terbuat dari ekstrak buah asli, menawarkan minuman bercita rasa blewah yang segar dan enak. Kehadiran blewah memberikan sentuhan manis dan segar yang melengkapi cita rasa kopi maupun teh, menciptakan kombinasi yang sempurna di setiap tegukan.\n*Menu makanan dan soft serve ice cream hanya tersedia di gerai Kopi Kenangan tertentu. Untuk informasi lebih lanjut, silakan kunjungi Instagram: @kopikenangan.id\nSeri Blewah Mewah dimeriahkan dengan rangkaian lima menu minuman, tiga menu makanan, dan dua menu soft serve ice cream yang bisa didapatkan di outlet Kopi Kenangan. Lima varian minuman Blewah Mewah terdiri dari Blewah Aerocano, Blewah Tea with Blewah Jelly, Blewah Latte, Oatside Blewah Latte, Freezy Blewah Tea with Blewah Jelly yang sudah bisa didapatkan di seluruh outlet Kopi Kenangan. Untuk menemani Para Mantan saat menikmati minuman, Kopi Kenangan juga menghadirkan Opor Pot Pie*, Blewah Cake*, dan Honey Date Pound Cake*, cemilan eksklusif di bulan Ramadan. Bagi Para Mantan yang ingin berbuka puasa dengan takjil manis dan segar, Kopi Kenangan juga menyediakan menu Blewah Soft Serve* dan Blewah Tea Float with Blewah Jelly*.\nEdward Tirtanata, Group CEO dan Co-Founder Kenangan Brands mengatakan, “Sebagai sebuah brand F&B di bawah naungan Kenangan Brands, kami sangat memahami animo masyarakat Indonesia dalam merayakan momen Ramadan, terutama saat menjalani ibadah puasa. Di tengah perayaan bulan Ramadan, buah blewah hadir di tengah-tengah masyarakat sebagai salah satu buah yang dicari karena kesegarannya. Inilah yang menjadi awal cerita seri Blewah Mewah, sesuatu yang unik dan segar khusus untuk Para Mantan yang ingin mencari sesuatu yang baru di bulan Ramadan. Kami harap, menu spesial ini dapat memberikan pengalaman dan kesegaran yang unik bersama Kopi Kenangan.”\nPengembangan produk-produk seri Blewah Mewah yang dilakukan oleh tim Research and Development Kopi Kenangan diracik dan dikurasi secara saksama untuk menghadirkan rasa otentik dari buah blewah dengan mengikuti pedoman Halal, guna memberikan kualitas terbaik bagi Para Mantan. Seluruh sajian seri Blewah Mewah sudah dapat ditemui di hampir seluruh gerai Kopi Kenangan, juga dapat dipesan melalui aplikasi Kopi Kenangan dan juga penyedia layanan pesan-antar makanan yang bekerja sama dengan Kopi Kenangan mulai dari tanggal 1 Maret - 30 April 2024.\nTentang Kopi Kenangan\nKopi Kenangan adalah jaringan F&B non-waralaba berkonsep New Retail yang memiliki pertumbuhan tercepat di Indonesia. Kopi Kenangan yang didirikan pada 2017 berhasil mengisi sweet spot antara kopi berharga tinggi yang disajikan pebisnis kopi internasional dan kopi instan yang dijual di kios pinggir jalan. Melalui pemahaman dan eksplorasi akan cita rasa lokal serta model bisnis 'New Retail' yang berfokus pada pengalaman offline dan online pelanggan, Kopi Kenangan memiliki visi untuk memperkenalkan kopi lokal berkualitas ke seluruh dunia. Visi ini terwujud melalui produk berkualitas yang terjangkau, layanan cepat dan bersahabat, pengendalian mutu, serta pengembangan bisnis yang kreatif. Untuk informasi lebih lanjut, silakan kunjungi www.kopikenangan.com dan ikuti perjalanan kami di Facebook: Kopi Kenangan, Instagram: @kopikenangan.id, Twitter: @kopikenangan_id dan Linkedin: Kopi Kenangan.\nNarahubung Media Kenangan Brands:\nRuth Davina\nCorporate Affairs Manager, Kenangan Brands\nruth.davina@kopikenangan.com\n*Menu makanan dan soft serve ice cream hanya tersedia di gerai Kopi Kenangan tertentu. Untuk informasi lebih lanjut, silakan kunjungi Instagram: @kopikenangan.id"
  },
  {
    "title": "",
    "link": "https://kopikenangan.com/news/kenangan-brands-paparkan-capaian-csr-sepanjang-tahun-2023-melalui-kenangan-baik",
    "date": "",
    "author": "Marketing Creative",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/5fa1095912d2fc6dfc63ac9c/1714986258355-CFB3Q1GPO4YQSJR4347I/Sesi+Talkshow+bersama+Arum+Gula.jpg",
    "content": "Melalui empat pilar Kenangan BAIK, Kenangan Brands wujudkan program kontribusi lingkungan dan sosial untuk Indonesia. \nJakarta, 14 Desember 2023 - Tahun 2023 menandai langkah pertama Kenangan Brands dalam mewujudkan targetnya untuk menjadi perusahaan yang sustainable sekaligus profitable. Didirikan pada tahun 2017, Kopi Kenangan yang telah berkembang menjadi Kenangan Brands, fokus untuk membangun bisnis yang berkelanjutan dan peduli terhadap tanggung jawab sosial. Pada hari ini Kenangan Brands dengan bangga mengumumkan berbagai pencapaian program CSR yang telah dicapai sepanjang tahun 2023. \nMenyadari pentingnya tanggung jawab lingkungan dan sosial, Dinamakan Kenangan BAIK (Bersama Indonesia Kuat), payung CSR ini hadir dalam 4 (empat) pilar utama, yang masing-masing pilarnya memiliki program dan pencapaian sendiri, yaitu: \nKenangan Berdaya \n(Pilar bagi seluruh program yang berhubungan dengan pemberdayaan komunitas petani dan supplier lokal lainnya, termasuk pemberian bantuan sosial) \nDi tahun 2023, Kenangan Brands memberikan sumbangan sebesar Rp271.613.000,00 ke asosiasi petani gula aren Arum Gula di Garut. Dana ini akan disalurkan untuk pengadaan alat panen dan memasak yang memadai untuk para petani. Selain itu, sumbangan yang diberikan juga akan dimanfaatkan untuk membangun 4 (empat) sarana fasilitas umum MCK (mandi, cuci, kakus). Selain itu, di tahun ini, Kenangan BAIK juga telah berhasil merampungkan pembangunan 3 sumur air di Flores.\nKenangan Jangan Dibuang \n(Pilar bagi seluruh program yang berhubungan dengan kampanye ekonomi sirkular dengan tujuan mengajak publik agar lebih sadar terhadap sampah konsumsi)\nKontribusi Kenangan Brands untuk pilar ini tidak akan berjalan tanpa dukungan dari penyedia jasa pengelolaan limbah. Pada tahun 2023, Kenangan Brands bekerja sama dengan; \na. Bell Living Lab, untuk mendaur ulang ampas kopi yang dihasilkan dari seluruh gerai Kopi Kenangan di Kota Bandung. Baru satu bulan berjalan, Bell Living Lab sudah berhasil mendaur ulang 1 ton ampas kopi menjadi produk-produk berbahan dasar kulit sintetis yang berasal dari ampas kopi\nb. Octopus Indonesia, yang menyediakan wadah khusus, bernama Octobox, untuk menampung limbah plastik dari gelas Kopi Kenangan dan mengubahnya menjadi produk daur ulang. Octobox akan segera tersedia di 15 gerai Kopi Kenangan \nc. Rekosistem, yang juga menyediakan wadah khusus untuk kantong belanja spunbond yang tidak digunakan. Dropbox spunbond ini sudah tersedia di 35 gerai Kopi Kenangan dan per 1 Desember 2023 sudah berhasil mengumpulkan lebih dari 10kg spunbond yang kemudian diolah kembali menjadi bahan dasar karbon cair \nd. FoodCycle, untuk program Bread Rescue yang telah berhasil mengalokasikan lebih dari 1700 roti ke panti asuhan dan panti jompo \ne. Tak lupa juga, untuk brand Chigo x Flip juga kami ikut sertakan dalam pilar Kenangan Sirkular, melalui pengumpulan lebih dari 50,000 kilogram minyak jelantah sepanjang tahun 2023 yang nantinya akan di daur ulang menjadi bio products\nKenangan PinTer (Pintar dan Terampil) \n(Pilar bagi seluruh program yang bertujuan untuk meningkatkan kecerdasan sekaligus keterampilan masyarakat yang belum memiliki akses edukasi yang mumpuni) \nPilar ketiga ini diwujudkan melalui program Kenangan Belajar Kopi, wadah pelatihan basic coffee training gratis bagi masyarakat di Jakarta, Surabaya, dan Medan. Diadakan di fasilitas training Kenangan Academy, para peserta diharapkan dapat memiliki kompetensi tambahan untuk membantu mereka di dunia kerja. Di tahun 2023, Kenangan Belajar Kopi sukses mencetak lebih dari 80 lulusan. \nBersama Kenangan \n(Pilar bagi seluruh program yang bertujuan untuk memberikan kesempatan bagi karyawan dalam mendapatkan pengakuan yang setara dan sesuai dengan kemampuannya) \nMemiliki lebih dari 900 gerai di Indonesia, Malaysia, dan Singapura, Kenangan Brands terus berupaya untuk memastikan kemampuan hard skill dan soft skill karyawannya senantiasa terasah. Diharapkan, hal ini dapat menjadi “modal” karyawan Kopi Kenangan untuk terus menghadirkan kopi lokal berkualitas bagi seluruh pelanggan di Indonesia dan dunia. Mewujudkan upaya tersebut, di tahun 2023 Kenangan Brands menggelar ajang Leadership Conference dan Kenangan Barista Championship kedua dengan tema “Leading with Heart”.\n“Kami meyakini bahwa kolaborasi dan keterlibatan semua pihak merupakan kunci untuk mencapai pembangunan berkelanjutan yang masif dan inklusif. Kenangan Brands akan terus berkomitmen untuk menjadi agen perubahan positif dan mengembangkan program CSR yang konkrit untuk masa depan yang lebih baik,” kata Inneke Lestari, Head of Legal & Corporate Affairs Kenangan Brands. \nKenangan Brands berharap seluruh rangkaian program Kenangan BAIK dapat membawa dampak yang positif bagi lingkungan dan masyarakat. \nTentang Kenangan Brands \nKenangan Brands adalah grup F&B berkonsep New Retail dengan pertumbuhan tercepat di Indonesia. Didirikan pada tahun 2017 dengan merek andalannya, Kopi Kenangan. Pada tahun 2020, Kenangan Brands mulai merambah ke kategori makanan seperti roti dan soft-baked cookies, dan juga Chigo x Flip yang menyajikan makanan gurih seperti fried chicken dan burger. Pada tahun 2022, kami meluncurkan inovasi terbaru kami dengan memasuki pasar FMCG melalui peluncuran produk Ready to Drink Kopi Kenangan Hanya Untukmu, Kopi Siap Minum dalam kemasan, sebagai usaha untuk mengembangkan dan memperluas pasar secara nasional, sekaligus menjawab tingginya antusias pelanggan terhadap Kopi Kenangan. Melalui pemahaman dan eksplorasi cita rasa lokal serta model online dan offline ‘ritel baru’ yang berfokus pada pengalaman pelanggan, Kenangan Brands memiliki visi untuk menjadi bisnis makanan dan minuman terbesar di Indonesia dan Asia Tenggara, dengan produk berkualitas terjangkau, cepat dan pelayanan yang ramah, quality control, dan pengembangan usaha kreatif.\nNarahubung Media Kenangan Brands: \nRuth Davina \nCorporate Affairs Manager, Kenangan Brands \nruth.davina@kopikenangan.com \ncorporateaffairs.dept@kopikenangan.com"
  },
  {
    "title": "",
    "link": "https://kopikenangan.com/news/kenangan-coffee-new-retail-fb-unicorn-pertama-di-asia-tenggara-mengambil-langkah-strategis-memasuki-pasar-singapura",
    "date": "",
    "author": "Marketing Creative",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/5fa1095912d2fc6dfc63ac9c/1714985538267-F4A7V8MTJHKGM615JL4C/1.JPG",
    "content": "Pembukaan gerai pertama Kenangan Coffee di Raffles City menandai langkah lanjutan perusahaan dalam rencana ekspansi global\nSingapura, 26 September 2023 - Kenangan Coffee (yaitu merek dagang internasional dari Kopi Kenangan), secara resmi hadir di Singapura dengan gerai pertama berlokasi di Raffles City Shopping Centre. Pembukaan ini diresmikan secara langsung oleh para Co-Founders Kopi Kenangan, Edward Tirtanata sebagai Group CEO, dan James Prananto sebagai Co-CEO Kopi Kenangan.\nMengikuti keberhasilannya di Malaysia tahun lalu, kehadiran Kenangan Coffee di Singapura sekaligus membuka kesempatan yang lebih bagi Kopi Kenangan untuk merangkul pasar Asia Tenggara dan juga kawasan lainnya, dan mewujudkan visi untuk memperkenalkan brand kopi asli Indonesia kepada dunia. Sejak berdiri pada 2017, Kopi Kenangan telah mencapai pertumbuhan yang luar biasa dengan mengoperasikan sekitar 900 outlet di 3 negara, termasuk 67 kota di Indonesia dan Kuala Lumpur, Malaysia.\n“Kenangan Coffee menggunakan biji kopi lokal Indonesia, diracik dari Indonesia untuk dunia. Kami berkomitmen untuk memperkenalkan budaya kopi Indonesia yang kaya akan cita rasa kepada dunia,” kata Edward Tirtanata, Group CEO and Co-Founder Kopi Kenangan. “Kecintaan orang Singapura terhadap kopi, dari kopitiam hingga toko kopi kekinian, telah menginspirasi kami untuk menghadirkan Kenangan Coffee di negara ini. Keberagaman dan kekayaan F&B Singapura menjadikan ekspansi ini sebagai milestone yang sangat penting, dan kami tidak sabar untuk melayani warga Singapura dengan rasa kopi khas Indonesia.”\nDari minuman berbasis espresso sampai minuman non-kopi, Kenangan Coffee mengkurasi menu-menu yang secara khusus dibuat untuk dapat diterima baik oleh lidah Asia maupun global dengan harga yang terjangkau. Pecinta kopi dapat menikmati Kenangan Latte (atau yang dikenal dengan menu Kopi Kenangan Mantan di Indonesia) hanya dengan S$4.90 (atau Rp56.350 berdasarkan kurs Rp11.500) sambil ditemani berbagai variasi makanan mulai dari harga S$2.90 (atau Rp33.500 berdasarkan kurs Rp11.500).\nJames Prananto, co-CEO Kopi Kenangan dan Co-Founder bercerita, “Sejalan dengan kata ‘Kenangan’ dalam Kenangan Coffee yang bersinonim dengan ‘memori/kisah’, kami ingin mengajak warga Singapura untuk menciptakan kenangan yang indah melalui secangkir kopi. Dari biji kopi hingga menjadi minuman, kami berkomitmen untuk secara konsisten memberikan kopi berkualitas tinggi dengan harga yang terjangkau. Dengan menggunakan mesin, peralatan, dan bahan dasar berkualitas tinggi, kami ingin menjadi brand kopi yang paling dekat dengan hati para pecinta kopi di Asia Tenggara, termasuk di Singapura.”\n“Perjalanan pertama kami dengan Kopi Kenangan mulai pada bulan April 2020. Saya menyaksikan sendiri evolusi bisnis dari Kopi Kenangan, di mana saat itu jumlah outlet masih berada di bawah angka 200, sampai sekarang mencapai angka lebih dari 850 outlet. Ambisi Kopi Kenangan lebih dari menyeduh—tapi untuk membawa minuman kopi asli Indonesia ke ranah global. Kopi Kenangan juga dilengkapi dengan tim yang mumpuni, dipimpin oleh Edward Tirtanata sebagai Group CEO dan Co-Founder. Perusahaan semakin berkembang di bawah kepemimpinan beliau, menarik perhatian talenta berbakat dari WeChat, Amazon, McKinsey, Burger King, sampai Starbucks,” kata Eduardo Saverin, Co-Founder & Co-CEO, B Capital. \nPeran Kenangan Academy \nSatu upaya lain dari perusahaan untuk meningkatkan dan menjaga kualitas Kenangan Coffee, perusahaan telah mempersiapkan Kenangan Academy untuk melatih calon-calon barista Kenangan Coffee. Sebagai tambahan, kini Kenangan Academy telah tersebar di Jakarta, Surabaya, Medan, Kuala Lumpur, dan Singapura, menekankan pentingnya pelatihan yang holistik bagi para barista sebelum mulai melayani pelanggan di outlet. Sampai saat ini, Kenangan Academy telah melatih dan mengeluarkan sertifikasi kepada 7.000+1 barista di Indonesia, Malaysia, dan kini Singapura. \nAplikasi Kenangan Coffee \nHampir serupa dengan Kopi Kenangan, pelanggan Kenangan Coffee juga ditawarkan kemudahan dalam bertransaksi melalui aplikasi. Pelanggan juga dapat mengumpulkan Kenangan Points jika melakukan pembelian melalui aplikasi lalu melakukan scan kode QR di kasir. Aplikasi Kenangan Coffee juga menawarkan berbagai macam keuntungan untuk pengguna seperti voucher khusus, promosi di hari ulang tahun, dan akses prioritas untuk produk baru. Semua ini difasilitasi untuk memberikan pelanggan pengalaman yang terbaik saat berinteraksi dengan Kenangan Coffee, dan juga sebagai dasar untuk perusahaan dalam melakukan inovasi produk. \nKenangan Coffee sedang mengeksplorasi dan mempersiapkan ekspansi berikutnya ke negara Asia Tenggara lainnya sebelum nantinya, Kenangan Coffee akan diperkenalkan di luar kawasan Asia Tenggara. \nUntuk informasi selanjutnya, silakan untuk mengunjungi Instagram Kenangan Coffee Singapore. \nTentang Kopi Kenangan \nKopi Kenangan adalah jaringan F&B berkonsep New Retail yang memiliki pertumbuhan tercepat di Indonesia. Kopi Kenangan yang didirikan pada 2017 berhasil mengisi sweet spot antara kopi berharga tinggi yang disajikan pebisnis kopi internasional dan kopi instan yang dijual di kios pinggir jalan. Melalui pemahaman dan eksplorasi akan cita rasa lokal serta model bisnis 'New Retail' yang berfokus pada pengalaman offline dan online pelanggan, Kopi Kenangan memiliki visi untuk memperkenalkan kopi lokal berkualitas ke seluruh dunia. Visi ini terwujud melalui produk berkualitas yang terjangkau, layanan cepat dan bersahabat, pengendalian mutu, serta pengembangan bisnis yang kreatif. Untuk informasi lebih lanjut, silakan kunjungi www.kopikenangan.com dan ikuti perjalanan kami di Facebook: Kopi Kenangan, Instagram: @kopikenangan.id, Twitter: @kopikenangan_id dan Linkedin: Kopi Kenangan. \nNarahubung Media Kenangan Brands: \nRuth Davina \nCorporate Affairs Manager, Kenangan Brands \nruth.davina@kopikenangan.com "
  },
  {
    "title": "",
    "link": "https://kopikenangan.com/news/kopi-kenangan-hanya-untukmu-hadir-dalam-perjalanan-petualangan-sherina-2",
    "date": "",
    "author": "Marketing Creative",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/5fa1095912d2fc6dfc63ac9c/1714984694264-QZLVH2SSXW1TMQGDLT8Q/Tim+Petualangan+Sherina+2+dan+Kopi+Kenangan+Hanya+Untukmu.jpg",
    "content": "Petualangan Sherina 2 menjadi pintu bagi Kopi Kenangan Hanya Untukmu untuk mendukung perfilman Indonesia\nJakarta, 31 Agustus 2023 - Dalam waktu kurang dari satu bulan, pecinta film Indonesia sudah bisa menonton Petualangan Sherina 2, tepatnya tanggal 28 September 2023. Pencinta film dan juga penggemar Petualangan Sherina dapat bernostalgia bersama dengan menyaksikan kelanjutan petualangan Sherina dan Sadam yang penuh aksi dalam film bergenre drama musikal ini. Kopi Kenangan Hanya Untukmu atau biasa dikenal Kopi Kenangan botol, hadir di tengah perjalanan Petualangan Sherina 2 untuk menunjukkan dukungannya terhadap industri kreatif Indonesia.\nSesuai DNA dari brand Kopi Kenangan Hanya Untukmu, minuman kopi dalam kemasan di bawah naungan Kenangan Brands hadir untuk mendukung kreativitas serta produktivitas anak bangsa. Film Petualangan Sherina 2 dibuat dengan menjunjung tinggi kreativitas dengan harapan film ini dapat membangun jiwa petualang para penggemarnya. Inilah yang menjadi alasan utama Kopi Kenangan Hanya Untukmu mendukung kembalinya Film Petualangan Sherina 2 di tengah masyarakat Indonesia. “Sejak Kopi Kenangan Hanya Untukmu diluncurkan, selain menjadi salah satu brand kopi dalam kemasan yang terdepan, kami juga berharap dapat memberikan kontribusi dan dukungan kepada industri kreatif Indonesia. Petualangan Sherina 2 menjadi film Indonesia pertama yang kami dukung, dan ke depannya, kami berharap dapat terus mendukung berbagai industri kreatif lainnya untuk semakin memajukan kreativitas dan produktivitas anak muda Indonesia,” kata Susan Ernawati, Head of Marketing Kopi Kenangan.\nSelain perjalanan Sherina dan Sadam, Petualangan Sherina 2 juga menghadirkan karakter-karakter baru yang diperankan oleh nama-nama yang tidak asing di dunia kreatif Indonesia saat ini, beberapa diantaranya adalah Isyana Sarasvati sebagai Ratih yang juga merupakan Brand Ambassador Kopi Kenangan Hanya Untukmu, dan Chandra Satria sebagai Syailendra. Kehadiran karakter Ratih dan Syailendra selintas membangkitkan memori penonton akan karakter Kertaredjasa dan Zus Natasya, pasangan tokoh antagonis pada film pertama.\n“Isyana dan Chandra memerankan Ratih dan Syailendra dengan sangat memukau. Kemampuan nyanyi dan acting mereka memberikan warna baru yang menyegarkan bagi film ini. Saya berharap publik nantinya juga dapat merasakan hal yang sama ketika menonton Petualangan Sherina 2,” kata Mira Lesmana, Producer Petualangan Sherina 2. Mira menambahkan, “Kami juga ingin berterima kasih kepada Kopi Kenangan Hanya Untukmu yang sudah hadir di tengah perjalanan Petualangan Sherina 2 dan saya pribadi berharap dapat bekerja sama lagi di lain waktu.”\nUntuk turut meramaikan Petualangan Sherina 2, Kopi Kenangan Hanya Untukmu juga mempersiapkan beberapa aktivitas kolaborasi, yaitu visual menarik yang menempel di kemasan, ornamen unik di minimarket kesayangan, dan juga kesempatan bagi konsumen untuk memenangkan tiket nonton gratis. “Kami berharap film Petualangan Sherina 2 dapat mengajak para penonton bernostalgia dan Kopi Kenangan Hanya Untukmu dapat menjadi bagian dalam kebahagiaan tersebut,” tutup Susan Ernawati.\n\nInformasi Tambahan\nIkuti terus kegiatan Kopi Kenangan Hanya Untukmu melalui kanal Instagram @kenangan.hanyauntukmu dan nantikan kesempatan Anda untuk memenangkan tiket nonton Petualangan Sherina 2 secara gratis. Kesempatan ini terbuka untuk siapa saja sesuai dengan syarat dan ketentuan yang berlaku.\n\nTentang Kopi Kenangan Hanya Untukmu\nBermula dari kecintaan terhadap kopi lokal Indonesia dan visi untuk mengembangkan kopi bercita rasa terbaik dari Indonesia hingga ke Asia, Kopi Kenangan yang didirikan pada 2017 telah berkembang menjadi jaringan F&B non-waralaba berkonsep New Retail dengan pertumbuhan tercepat di Indonesia. Sebagai perusahaan New Retail F&B Unicorn pertama di Asia Tenggara, Kopi Kenangan yang berada di bawah naungan Kenangan Brands kini meluncurkan produk FMCG, dimulai dengan produk ready-to-drink yang bernama Kopi Kenangan Hanya Untukmu, kopi siap minum dalam kemasan sebagai usaha untuk mengembangkan dan memperluas pasar secara nasional, sekaligus menjawab tingginya antusiasme pelanggan terhadap Kopi Kenangan. Untuk informasi lebih lanjut, silakan kunjungi www.kopikenangan.com dan ikuti perjalanan kami di Facebook: @kenangan.hanyauntukmu serta Instagram: @kenangan.hanyauntukmu\nTentang Kenangan Brands\nKenangan Brands adalah grup F&B berkonsep New Retail dengan pertumbuhan tercepat di Indonesia. Didirikan pada tahun 2017 dengan merek andalannya, Kopi Kenangan. Pada tahun 2020, Kenangan Brands mulai merambah ke kategori makanan seperti roti dan soft-baked cookies, dan juga Chigo x Flip yang menyajikan makanan gurih seperti fried chicken dan burger. Pada tahun 2022, kami meluncurkan inovasi terbaru kami dengan memasuki pasar FMCG melalui peluncuran produk Ready to Drink Kopi Kenangan Hanya Untukmu, Kopi Siap Minum dalam kemasan, sebagai usaha untuk mengembangkan dan memperluas pasar secara nasional, sekaligus menjawab tingginya antusias pelanggan terhadap Kopi Kenangan. Melalui pemahaman dan eksplorasi cita rasa lokal serta model online dan offline ‘ritel baru’ yang berfokus pada pengalaman pelanggan, Kenangan Brands memiliki visi untuk menjadi bisnis makanan dan minuman terbesar di Indonesia dan Asia Tenggara, dengan produk berkualitas terjangkau, cepat dan pelayanan yang ramah, quality control, dan pengembangan usaha kreatif.\nTentang Petualangan Sherina 2\nFilm Petualangan Sherina pertama, film layar lebar produksi pertama Miles Films, dirilis di bioskop nasional pada Juni 2000 dan langsung menjadi fenomena. Tidak hanya mencetak sukses di box office di tengah lesunya perfilman Indonesia saat itu, tapi juga berhasil membawa kembali keluarga Indonesia ke bioskop. Mereka datang berbondong-bondong untuk mengantri panjang demi mendapatkan tiket. Dan sekarang, setelah 23 tahun berlalu, film Petualangan Sherina 2 akan hadir di bioskop mulai tanggal 28 September 2023 untuk menyapa penggemarnya. Film ini disutradarai oleh Riri Riza dan diproduseri Mira Lesmana.\nNarahubung Media Kenangan Brands:\nRuth Davina\nCorporate Affairs Manager, Kenangan Brands\nruth.davina@kopikenangan.com\ncorporateaffairs.dept@kopikenangan.com"
  },
  {
    "title": "",
    "link": "https://kopikenangan.com/news/rayakan-harmanas-ke-6-ceo-kopi-kenangan-danbasboi-sajikan-kopi-kenangan-mantan-untuk-pelanggansetia-karena-u-da-best",
    "date": "",
    "author": "Marketing Creative",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/5fa1095912d2fc6dfc63ac9c/1692082717336-84NFCAOPG6R4J6DC5OOM/Edward+Tirtanata+dan+Basboi.jpg",
    "content": "Berikan yang terbaik untuk pelanggan setia, CEO Kopi Kenangan Edward Tirtanata dan Basboi hadir sebagai Baperista di gerai Kopi Kenangan.\nAda yang istimewa dalam perayaan enam tahun Kopi Kenangan tahun ini. Untuk merayakan Hari Mantan Nasional (HARMANAS) yang jatuh setiap bulan Agustus, tahun ini Kopi Kenangan memberi kejutan bagi para pelanggan yang telah setia menemani setiap perjalanan Kopi Kenangan. Mengusung tema “U Da Best”, Kopi Kenangan sadar bahwa “Para Mantan” inilah, panggilan sayang Kopi Kenangan bagi para pelanggannya, yang telah tanpa henti mendukung Kopi Kenangan mencapai visinya, yaitu memperkenalkan kopi lokal berkualitas ke seluruh dunia.\nUntuk meramaikan tema HARMANAS tahun ini, Kopi Kenangan menggandeng Basboi sebagai Brand Ambassador dan berkolaborasi meluncurkan jingle U Da Best yang menggambarkan apresiasi Kopi Kenangan kepada berbagai pihak, terutama Para Mantan, yang telah setia memilih Kopi Kenangan dalam menemani setiap keseharian mereka.\nKampanye U Da Best ini juga dimeriahkan oleh kehadiran CEO Kopi Kenangan, Edward Tirtanata, dan Basboi di gerai Kopi Kenangan Kota Kasablanka pada hari ini (11/8) yang berkolaborasi untuk menyajikan 600 cup Kopi Kenangan Mantan. Lengkap dengan atribut Baperista, Edward dan Basboi berhasil menyeduh 600 kopi ter-Da Best untuk Para Mantan hanya hanya dalam waktu 2 jam.\n“Tidak terasa sudah enam tahun Kopi Kenangan hadir menyajikan kopi berkualitas bagi masyarakat Indonesia. Seluruh pencapaian ini tentunya merupakan kerja keras seluruh Tim Kopi Kenangan. Kami juga sekaligus ingin mengapresiasi Para Mantan, dan seluruh pihak terkait yang terus memberikan dukungan. Kami berkomitmen untuk terus menyajikan minuman dan makanan dengan cita rasa lokal berkualitas tinggi bagi seluruh pelanggan setia kami,” terang Edward Tirtanata, CEO & Co-Founder Kopi Kenangan.\nBasboi, Brand Ambassador Kopi Kenangan mengungkapkan antusiasmenya terhadap perayaan ulang tahun Kopi Kenangan tahun ini, “Kopi Kenangan sudah setia menemani aku mulai dari kuliah hingga berkarir di industri musik, jadi seneng banget saat diajak untuk ikut merayakan HARMANAS ke-6 ini, apalagi pada saat diajak menyajikan Kopi Kenangan Mantan bersama Pak Edward. Semoga Para Mantan juga bisa ikut berbahagia dan merayakan bersama kemeriahan HARMANAS tahun ini.”\nDi usia ke-6, Kopi Kenangan juga sudah melebarkan sayapnya ke berbagai lini bisnis F&B di bawah naungan Kenangan Brands dan telah memiliki lebih dari 900 gerai di berbagai wilayah Indonesia. Memasuki usia yang baru, Kopi Kenangan berharap bisa terus mewarnai rutinitas Para Mantan melalui segelas kopi dengan kualitas terbaik.\nGebyar Kenangan\nPerayaan HARMANAS, tidak lengkap tentunya jika tidak diiringi dengan hadiah spesial untuk Para Mantan. Sebagai puncak acara HARMANAS, Kopi Kenangan akan melakukan pengundian Gebyar Kenangan untuk Para Mantan yang beruntung. Tak tanggung-tanggung, hadiah yang diberikan pada kegiatan Gebyar Kenangan ini meliputi 1E-Voucher travel Umroh senilai Rp 40.000.000,-, 1 E-Voucher travel ke Eropa senilai Rp 30.000.000,-, 2 iPad, 2 sepeda listrik, dan hadiah menarik lainnya. Cara ikut sertanya sangat mudah, cukup dengan melakukan pembelian minimal Rp40.000,-/transaksi untuk semua menu Kopi Kenangan atau Chigo x Flip melalui aplikasi maupun di gerai terdekat, pembeli akan menerima 1 kode unik (berlaku kelipatan) untuk mendapatkan kesempatan memenangkan hadiah. Jangan sampai ketinggalan untuk ikut meramaikan Gebyar Kenangan, karena periode pengumpulan undian masih dibuka hingga 17 Agustus 2023.\n\nUntuk informasi detail mengenai kegiatan perayaan HARMANAS ke-6 serta Gebyar Kenangan, dapat dipelajari lebih lanjut di aplikasi Kopi Kenangan, atau kunjungi www.kopikenangan.com dan lini media sosial Kopi Kenangan di Facebook: Kopi Kenangan, Instagram: @kopikenangan.id, Twitter: @kopikenangan_id."
  },
  {
    "title": "",
    "link": "https://kopikenangan.com/news/babak-baru-kenangan-brands-fokus-menjadi-perusahaan-fampbnbsp-berkelanjutan-di-tahun-2030",
    "date": "",
    "author": "Marketing Creative",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/5fa1095912d2fc6dfc63ac9c/1684896372999-AST2V6MR59ZXKPVENNDS/Sesi+QnA.JPG",
    "content": "Kenangan Sustainability Journey 2030 menjadi strategi Kenangan Brands dalam memastikan keberlangsungan bisnis perusahaan dengan tetap menjaga keberlanjutan lingkungan, sosial dan tata kelola\nSejak berdiri tahun 2017, Kopi Kenangan yang telah berkembang menjadi Kenangan Brands fokus untuk membangun bisnis yang sehat dan berkelanjutan. Untuk mencapai hal tersebut, pada hari ini, Kenangan Brands memperkenalkan strategi baru yang akan menjadi standar perusahaan dalam menjalankan bisnisnya. Sebagai grup F&B berkonsep New Retail di Indonesia, Kenangan Brands sadar bahwa perusahaan yang berkelanjutan (sustainable) harus menjadi perusahaan yang sehat secara finansial (profitable), sehingga dapat mendukung berbagai faktor lingkungan, sosial, tata kelola (ESG-Environment, Social, dan Governance). Melalui strategi baru ini, Kenangan Brands memiliki target untuk menjadi perusahaan yang sustainable sekaligus profitable pada tahun 2030.\nBergerak di bidang F&B, beberapa strategi seperti ekspansi gerai, inovasi produk, juga upaya pemasaran yang intensif telah dilakukan Kenangan Brands untuk menjalankan bisnis yang sehat guna membangun profitabilitas positif. Namun, perusahaan sadar bahwa strategi yang holistik diperlukan untuk memastikan bisnis dapat berkembang di ranah berkelanjutan. Oleh karena itu, perusahaan saat ini telah mulai menerapkan eco-friendly operations dengan fokus utama untuk mencapai Zero Waste to Landfill. Pada tahun 2030, diharapkan Kenangan Brands dapat berhasil mencegah sampah operasional masuk ke tempat pembuangan akhir (TPA), dengan cara mengurangi sampah dan bekerja sama dengan mitra terpercaya untuk mendaur ulang sampah-sampah tersebut. Kenangan Brands juga akan mendonasikan makanan-makanan hasil produksi yang layak konsumsi kepada orang-orang yang membutuhkan.\nKenangan Sustainability Journey 2030\nKenangan Sustainability Journey 2030 adalah strategi Kenangan Brands untuk mencapai target-target berkelanjutan perusahaan. Strategi ini dirancang berdasarkan pedoman-pedoman ESG dan juga Sustainability Development Goals 2030 yang ditetapkan oleh Perserikatan Bangsa-Bangsa (PBB).  Dalam menjalankan strategi ini, Kenangan Brands membagi setiap Tujuan Pembangunan Berkelanjutan 2030 dalam 4 (empat) pilar, dimana masing-masing pilar memiliki target yang harus dicapai, mulai dari:\nHappy People \nPilar ini bertujuan untuk menyejahterakan kurang lebih 6,000 karyawan operasional maupun head office Kenangan Brands. Perusahaan menargetkan untuk menjaga angka 0 (zero) major incident melalui berbagai SOP dan pelatihan yang mumpuni. Selain itu, Kenangan Brands juga memiliki target kesetaraan gender agar di tahun 2030, perusahaan bisa memiliki 50% karyawan wanita dan pria yang setara, baik di level manajemen maupun level operasional.\nProtect Our Planet\nSesuai dengan namanya, pilar ini bertujuan untuk melindungi lingkungan dengan menjaga dan mengatur efisiensi penggunaan energi dan emisi, sekaligus mencegah seluruh sampah operasional Kenangan Brands berakhir di tempat pembuangan akhir (TPA). Perusahaan telah melakukan kalkulasi awal untuk penggunaan energi dan emisi CO2, air, serta sisa ampas kopi pada tahun 2022, dan menargetkan untuk mengurangi 15% penggunaan energi, dan juga 10% penggunaan air pada tahun 2030.\nGreat Coffee\nMeskipun Kenangan Brands tidak hanya memiliki produk kopi, kopi adalah DNA yang membentuk perusahaan menjadi seperti sekarang. Great Coffee adalah pilar berkelanjutan yang bertujuan untuk meningkatkan produktivitas dan inovasi produk, sehingga dapat terus menjaga profitabilitas Kenangan Brands. Selain menjaga sertifikasi keamanan pangan seperti HACCP dan Halal, perusahaan juga berharap seluruh gerai Kenangan Brands mendapatkan Sertifikasi Usaha Pariwisata (SUP). Inovasi dan pengembangan produk juga akan terus digencarkan sehingga pada tahun 2030, ekspansi gerai dapat mencapai setidaknya 5 negara di Asia Tenggara.\nStrong Communities\nSelain ranah internal, Kenangan Brands juga ingin mengambil peran untuk berkontribusi kepada komunitas sekitar agar dapat secara bersama-sama menjadi lebih kuat. Mulai dari memperhatikan komunitas supplier lokal dengan memberikan berbagai bantuan infrastruktur maupun bantuan akademis/keterampilan, perusahaan juga ingin mengajak masyarakat melalui berbagai kampanye sosial untuk lebih aktif dalam memperhatikan sampah konsumsi mereka, khususnya sampah plastik. Di samping itu, perusahaan juga akan mengalokasikan anggaran procurement untuk membangun infrastruktur yang diperlukan supplier-supplier lokal Indonesia, serta berperan aktif dalam memberikan bantuan sosial.\n“Infusing purpose into every drop we brew, merupakan tagline kami dalam strategi keberlanjutan, yang mengingatkan kami bahwa setiap gelas kopi yang kami sajikan kepada konsumen memiliki suatu arti dan tujuan vang lebih dari sekedar minuman. Setiap langkah bisnis yang kami ambil untuk menciptakan setiap gelas Kopi Kenangan akan selalu difokuskan pada suatu tujuan, yaitu menciptakan masa depan yang lebih baik,” kata Edward Tirtanata, Group CEO of Kenangan Brands. Dia melanjutkan, \"Tidak hanya melibatkan karyawan, tapi kami juga ingin mengajak para konsumen Kenangan Brands untuk bersama-sama mengambil peran dalam menjaga bumi kita\"\nKenangan BAIK\nUntuk mewujudkan target kontribusi publik Kenangan Sustainability Journey 2030, perusahaan juga membuat payung kontribusi sosial yang menaungi berbagai program CSR perusahaan. Dinamakan Kenangan BAIK (Bersama Indonesia Kuat), payung CSR ini hadir dalam 4 (empat) pilar utama, yang masing-masing pilarnya memiliki program sendiri, yaitu:\nKenangan Berdaya\nPilar bagi seluruh program yang berhubungan dengan pemberdayaan komunitas petani dan supplier lokal lainnya, termasuk pemberian bantuan sosial. \nKenangan Sirkular\nPilar bagi seluruh program yang berhubungan dengan kampanye ekonomi sirkular dengan tujuan mengajak publik agar lebih sadar terhadap sampah konsumsi.\nKenangan PinTer (Pintar dan Terampil)\nPilar bagi seluruh program yang bertujuan untuk meningkatkan kecerdasan sekaligus keterampilan masyarakat yang belum memiliki akses edukasi yang mumpuni.\nBersama Kenangan\nPilar bagi seluruh program yang bertujuan untuk memberikan kesempatan bagi karyawan dalam mendapatkan pengakuan yang setara dan sesuai dengan kemampuannya.\n“Kami berharap dengan adanya Kenangan BAIK, Kenangan Brands dapat menjadi lebih konsisten dalam memainkan perannya bagi masyarakat Indonesia,” kata Inneke Lestari, Head of Legal & Corporate Affairs. “Ke depan, kami akan lebih giat dalam memaparkan apa saja yang dilakukan Kenangan Brands melalui Kenangan BAIK.”\nKenangan Brands berharap dengan strategi terbaru yang berlandasan nilai-nilai ESG, perusahaan dapat menjadi perusahaan F&B berkonsep New Retail yang tidak hanya profitable, namun juga sustainable di tahun 2030.\n"
  },
  {
    "title": "",
    "link": "https://kopikenangan.com/news/makan-tanpa-ragu-seluruh-produk-kenangan-brands-telah-kantongi-sertifikasi-halal",
    "date": "",
    "author": "Marketing Creative",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/5fa1095912d2fc6dfc63ac9c/1681109370217-L82TNPWD567C5LCFCSVR/Screen+Shot+2023-04-10+at+13.45.49.png",
    "content": "Mulai dari Kopi Kenangan, Kopi Kenangan Hanya Untukmu, Chigo x Flip, hingga Kenangan Heritage sekarang sudah tersertifikasi halal\nPelanggan Kenangan Brands kini bisa mengonsumsi seluruh produk Kenangan Brands tanpa rasa ragu. Kenangan Brands secara resmi mengumumkan bahwa seluruh produk Kopi Kenangan, Kopi Kenangan Hanya Untukmu (KKHU), Chigo x Flip, dan Kenangan Heritage telah tersertifikasi halal di Indonesia. Awal tahun 2023 ini, Badan Penyelenggara Jaminan Produk Halal atau BPJPH, secara resmi telah menerbitkan sertifikasi halal untuk Chigo x Flip dan Kenangan Heritage. Dengan demikian proses sertifikasi halal untuk seluruh produk Kenangan Brands telah lengkap dan hal ini merupakan bukti komitmen Kenangan Brands kepada para pelanggan untuk terus memperhatikan kualitas produk yang ditawarkan, mulai dari bahan mentah hingga proses pengemasan produk. \nPihak Kenangan Brands pun berterima kasih untuk setiap pihak yang telah berkontribusi sehingga tercapai sertifikasi halal untuk seluruh produknya. “Sertifikasi halal untuk produk-produk F&B menjadi tolak ukur yang sangat penting. Untuk itu, kami sangat berterima kasih atas seluruh kerja keras tim Kenangan Brands serta tim BPJPH dan LPPOM MUI yang telah turut serta membimbing dan membantu kami mendapatkan sertifikasi halal. Komitmen ini akan selalu kami jaga dan prioritaskan demi kenyamanan konsumen ketika mengonsumsi produk Kenangan Brands,” terang James Prananto, Presiden Direktur Kenangan Brands.  \nSejak tahun 2019, Kenangan Brands sudah memulai usaha dalam mewujudkan sertifikasi halal untuk berbagai brand makanan dan minuman yang ada di bawah naungannya. Meskipun sempat diterpa pandemi, proses ini terus berlanjut hingga akhirnya awal tahun ini telah resmi mendapatkan sertifikasi halal untuk seluruh produk Kenangan Brands. Sebagai merek unggulan, Kopi Kenangan berhasil memperoleh sertifikasi halal di tahun 2020, bahkan berhasil meraih penghargaan “The Best Halal Assurance System Implementation” untuk kategori restoran di acara LPPOM MUI Halal Award 2022. Setelah Kopi Kenangan, kemudian disusul oleh merek ready-to-drink (RTD) Kopi Kenangan Hanya Untukmu di tahun 2021.\nTurut serta merayakan pencapaian ini, Muhammad Aqil Irham,  selaku Kepala Badan Penyelenggara Jaminan Produk Halal (BPJPH), menyampaikan apresiasinya kepada Kenangan Brands. “Alhamdulillah bertambah lagi produk yang bersertifikat halal, dengan terdaftarnya Chigo x Flip, dan Kenangan Heritage, merk dagang dibawah Kenangan Brands atau yang terdaftar dalam sistem kami PT Bumi Berkah Boga telah mencatatkan total 389 produknya bersertifikat halal. Hal ini tentu hal baik dan patut ditiru oleh rekan pelaku usaha lainnya dalam stream bisnis serupa,” tutur Kepala BPJPH. \n“Kami sebagai regulator dalam Jaminan Produk Halal, terus mengingatkan khususnya bagi para pelaku industri Food & Beverages karena tahun 2024 sudah tinggal menghitung bulan saja, kewajiban sertifikasi halal sudah di depan mata. Kami tidak bisa sendirian, bersama para pelaku usaha, masyarakat, mari kita sambut kewajiban sertifikasi halal ini untuk bersama-sama pajang label halal di pusat-pusat perbelanjaan, jika sudah bersertifikat halal segera pasang, bagi yang belum segera daftar, dan masyarakat juga bisa bantu ingatkan, colek pelaku usahanya, colek kami, dengan begitu cita-cita kita menjadi pusat produsen produk halal nomor 1 dunia bisa terwujud,” ungkap pria yang akrab disapa Aqil \n“Banyaknya varietas kopi asli Indonesia yang jadi komoditas ekspor unggulan, serta bermunculannya kedai kopi  sebagai tempat berkumpulnya anak muda, kami harapkan Kopi Kenangan bisa jadi duta halal, untuk membantu kami membangkitkan semangat para pelaku usaha mencatatkan produk kopi-nya bersertifikat halal serta bersama-sama mengingatkan generasi anak muda pentingnya produk bersertifikat halal,” terang Muhammad Aqil Irham.\nLPPOM MUI juga menyampaikan ucapan selamat kepada Kenangan Brands. “Kami mengucapkan selamat dan apresiasi sebesar-besarnya kepada Kenangan Brands atas tercapainya prestasi tersertifikasi halalnya seluruh brand di bawah grup ini. Tentu ini bukan perjalanan yang mudah. Namun, dengan segala komitmen dan kerjasama dari top manajemen hingga di seluruh bagian outlet, sertifikat halal dapat diraih. Selama masa berlaku sertifikat halal 4 tahun, kami harap perusahaan dapat terus menjaga konsistensi Sistem Jaminan Produk Halal (SJPH) yang sudah diterapkan,” ucap Muti Arintawati, Direktur Utama LPPOM MUI. \nKini seluruh lini produk di bawah naungan Kenangan Brands sudah memiliki sertifikasi halal yang aman untuk semua konsumen. Mulai dari bahan yang digunakan hingga kemasan produk terjamin menggunakan bahan yang berkualitas dan juga halal. Memenuhi kebutuhan dan demand konsumen di Indonesia, Kenangan Brands sadar bahwa sertifikasi halal merupakan salah satu hal yang penting bagi para konsumen. Kedepannya, mendukung hal ini, Kenangan Brands juga akan terus berupaya meningkatkan kualitas produk dari setiap lini makanan dan minuman yang disajikan untuk masyarakat Indonesia.\n"
  },
  {
    "title": "Serba 12, Chigo X Flip Luncurkan Menu KrunChi Fried Chicken Dengan 12 Bumbu Spesial Dan Dimarinasi Selama 12 Jam!",
    "link": "https://kopikenangan.com/news/serba-12-chigo-x-flip-luncurkan-menu-krunchi-fried-chicken-dengan-12-bumbu-spesial-dan-dimarinasi-selama-12-jam",
    "date": "3/13/23",
    "author": "Marketing Creative",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/5fa1095912d2fc6dfc63ac9c/1681109510913-TUP3JVYXWD4PC3XGLUS6/Chigo+x+Flip+New+Menu+-+KrunChi.jpg",
    "content": "Memperkenalkan KrunChi, menu fried chicken terbaru dari Chigo x Flip yang dimarinasi selama 12 jam dengan 12 bumbu spesial untuk hadirkan cita rasa sempurna dan tahan garing\nSebagai bentuk komitmen memenuhi kebutuhan dari konsumen, salah satu merek dagang yang ada di bawah naungan Kenangan Brands, yaitu Chigo x Flip, memberikan kejutan menarik pada tanggal 12 Maret 2023 kemarin dengan menghadirkan menu terbaru, KrunChi fried chicken. Sebelumnya, Chigo x Flip telah memiliki berbagai menu olahan daging ayam dan kini juga menyajikan menu burger yang tersedia di 66 gerai Chigo x Flip di seluruh Indonesia.\nRiri Heryanti, Head of Brand & Communication Kenangan Brands, mengatakan bahwa peluncuran menu baru ini bertujuan untuk memberikan pengalaman baru dalam menikmati varian fried chicken dari Chigo x Flip. “Sebagai perusahaan F&B di Indonesia, kami harus terus mengikuti perkembangan dan tren di dunia perkulineran. Kali ini, kami menghadirkan menu baru KrunChi fried chicken khusus untuk penggemar santapan ayam dan menu ini sudah tersedia di seluruh gerai Chigo x Flip,” terangnya. \nMenu KrunChi fried chicken dari Chigo x Flip hadir dengan perpaduan rasa dari 12 bumbu spesial yang khas dengan proses marinasi selama 12 jam. Chigo x Flip memadukan beberapa bumbu seperti kedelai, bawang putih, bubuk paprika, lada hitam, dan bumbu rahasia lainnya untuk menghadirkan cita rasa yang sempurna. Selain perpaduan bumbu-bumbu rahasia, menu KrunChi fried chicken juga dibaluri tepung berganda sehingga menghadirkan kerenyahan yang tidak diragukan lagi.  \n“Kami berharap masyarakat Indonesia memiliki antusiasme yang positif dalam menerima menu baru dari Chigo x Flip kali ini. Kenangan Brands akan selalu memberikan inovasi produk F&B yang sesuai dengan permintaan dan kebutuhan para pelanggan,” kata James Prananto, Co Founder & President Director Kenangan Brands.\nDibuat dari bahan-bahan premium yang sudah terjamin kehalalannya, Chigo x Flip tetap mengutamakan harga yang ramah di kantong konsumen. Menu KrunChi fried chicken ini bisa dinikmati dengan harga promo mulai dari Rp12.000,- yang berlaku dari tanggal 15 sampai dengan 26 Maret 2023, dan telah tersedia di semua gerai Chigo x Flip, serta dapat dipesan juga melalui aplikasi Kopi Kenangan dan penyedia layanan pesan-antar makanan yang bekerjasama dengan Chigo x Flip."
  },
  {
    "title": "Sejukkan Panasnya Suasana Hati, Kopi Kenangan Hadirkan Seri Minuman Dingin Terbaru",
    "link": "https://kopikenangan.com/news/sejukkan-panasnya-suasana-hati-kopi-kenangan-hadirkan-seri-minuman-dingin-terbaru",
    "date": "2/6/23",
    "author": "Marketing Creative",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/5fa1095912d2fc6dfc63ac9c/1675930346319-AIRMJJNQT98VMO121GQS/Kopi+Kenangan+-+Freezy.jpg",
    "content": "Memperkenalkan FREEZY Series, kategori minuman terbaru dari Kopi Kenangan yang bisa dinginkan hari (dan hati) mu!\nMenyambut 2023, Kopi Kenangan sebagai perusahaan F&B non-waralaba berkonsep New Retail dengan pertumbuhan tercepat di Indonesia, kembali meluncurkan kategori minuman terbaru untuk melengkapi pilihan menu. Hari ini, pelanggan setia Kopi Kenangan dapat menikmati seri minuman dingin terbaru, FREEZY Series yang sudah tersedia di hampir seluruh gerai Kopi Kenangan di Indonesia.\n“FREEZY Series adalah minuman ice blended yang dibuat secara khusus bagi para pelanggan yang ingin merasakan sensasi dingin baru dari Kopi Kenangan,” kata Riri Heryanti, Head of Brand & Communications Kopi Kenangan. “Di tahap awal ini, kami meluncurkan empat varian rasa FREEZY Series yang merupakan pilihan rasa favorit di Kopi Kenangan, yaitu: FREEZY Kopi Kenangan Mantan, FREEZY Dutch Chocolate, FREEZY Mocha Latte, dan FREEZY Latte. Kami berharap keempat varian ini dapat dinikmati oleh pelanggan setia Kopi Kenangan dan pastinya akan kami kembangkan ke depannya. FREEZY Series sudah dapat dinikmati di hampir seluruh gerai Kopi Kenangan, mulai dari hari ini,” tambahnya.\nBerbeda dari minuman Kopi Kenangan pada umumnya, FREEZY Series memberikan pengalaman baru bagi para pelanggan melalui setiap rasa yang dipilih. FREEZY Kopi Kenangan Mantan dapat menjadi alternatif penggemar setia Kopi Kenangan melalui sensasi dingin barunya; FREEZY Dutch Chocolate adalah untuk mereka yang menyukai minuman creamy dan rich dari cokelat asli Belanda tapi tanpa campuran kopi. Sedangkan, FREEZY Mocha Latte dibuat untuk mereka yang menyukai paduan khas antara cokelat asli Belanda dan kopi; dan FREEZY Latte yang sangat cocok untuk mereka yang menyukai perpaduan kopi Espresso berkualitas dengan susu segar yang simple dan praktis.\n“FREEZY Series adalah salah satu kategori menu baru yang sudah kita siapkan dan kembangkan sejak tahun lalu, dan kami sangat bangga akhirnya seri ini dapat dinikmati oleh publik. Kami berharap, Kenangan Brands dapat selalu memberikan inovasi-inovasi yang sesuai dengan permintaan dan kebutuhan para pelanggan, sehingga kami bisa terus menjadi solusi untuk setiap cravings yang diinginkan para pelanggan,” kata Edward Tirtanata, CEO & Founder Kenangan Brands.\nKeempat menu FREEZY Series ini sudah melewati tahap uji kualitas yang ketat dan pasti sudah terjamin kehalalannya. Keempat varian menu FREEZY Series sudah dapat ditemui di hampir seluruh gerai Kopi Kenangan, juga dapat dipesan melalui aplikasi Kopi Kenangan dan juga penyedia layanan pesan-antar makanan yang bekerjasama dengan Kopi Kenangan.\n"
  },
  {
    "title": "Hadiah Ulang Tahun Pertama, Kenangan Heritage Peroleh Penghargaan Jakarta Tourism Award 2022 ",
    "link": "https://kopikenangan.com/news/hadiah-ulang-tahun-pertamanbspkenangan-heritage-peroleh-penghargaan-jakarta-tourism-award-2022nbsp",
    "date": "12/15/22",
    "author": "Marketing Creative",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/5fa1095912d2fc6dfc63ac9c/1671643372045-D4SPRTF09T15JGH5L82D/Copy+of+WhatsApp+Image+2022-12-16+at+09.55.44.jpeg",
    "content": "Setelah merayakan ulang tahun pertama, Kenangan Heritage memperoleh hadiah berupa penghargaan dari Jakarta Tourism Award 2022 dalam bidang penyedia Jasa Makanan & Minuman kategori Cafe\nBertepatan dengan ulang tahun yang pertama pada 25 November 2022 lalu, Kenangan Heritage,  flagship store Kopi Kenangan dalam naungan Kenangan Brands, mendapatkan penghargaan dari ajang Jakarta Tourism Award Adhikarya Wisata 2022 yang diselenggarakan oleh Dinas Pariwisata dan Ekonomi Kreatif DKI Jakarta pada Jumat (9/12) di Hotel Borobudur, Jakarta Pusat. Kenangan Heritage berhasil menjadi penyedia jasa makanan & minuman terbaik di kategori Cafe.\nCynthia Chaerunnisa, Co-Founder Kenangan Brands mengatakan, “Kami sangat berterima kasih atas apresiasi yang dianugerahkan oleh Disparekraf sebagai penyelenggara, serta tim juri yang merupakan figur berpengaruh di bidang pariwisata, panitia, konsumen, dan seluruh tim Kenangan Brands. Pencapaian ini merupakan bentuk apresiasi atas kerja keras Kenangan Brands dalam memberikan pengalaman F&B yang terbaik untuk para pelanggan, sekaligus menjadi motivasi bagi kami untuk terus berinovasi dalam mengolah dan menghadirkan produk dengan bahan premium berkualitas lainnya,” terang Cynthia. \nBersaing dengan 314 pelaku usaha lainnya, Kenangan Heritage mampu membawa pulang penghargaan untuk kategori Cafe terbaik. Penilaian Jakarta Tourism Award mengacu pada tiga aspek utama yaitu, prestasi (kinerja usaha secara finansial dan non finansial), kontribusi (dampak terhadap ekonomi, sosial budaya, dan lingkungan), serta dedikasi (komitmen dan kesesuaian dengan regulasi). Ajang Jakarta Tourism Award tahun ini juga melibatkan usaha-usaha lainnya di industri pariwisata dan pelaku ekonomi kreatif dengan 31 kategori. \nKemenangan ini menjadi salah satu bukti positif keberhasilan dan keseriusan Kenangan Heritage dalam memberikan pengalaman baru dan spesial dalam menikmati kopi di cafe, dengan perpaduan budaya lokal Indonesia melalui aneka menu minuman kopi yang diolah dari biji kopi pilihan dari seluruh Nusantara. \nJakarta Tourism Award (JTA)\nPenghargaan Jakarta Tourism Award (JTA) merupakan nama baru penghargaan Adikarya Wisata. Ajang bergengsi yang diselenggarakan Dinas Pariwisata dan Ekonomi Kreatif Provinsi DKI Jakarta ini awalnya dilatarbelakangi oleh kegiatan Kelapa Jaya, yang merupakan pelopor penghargaan dalam bidang Industri Pariwisata pada 1974. Penghargaan Kelapa Jaya berakhir pada 1989 dan berganti nama menjadi Adikarya Wisata pada 1991. Jakarta Tourism Award membidik delapan jenis usaha dan 31 kategori sub-usaha yang bertujuan untuk memberikan sinergi terhadap pengembangan sektor ekonomi kreatif sehingga bisa bersama tumbuh dan berkembang dalam memajukan perekonomian Provinsi DKI Jakarta. "
  },
  {
    "title": "Kopi Kenangan Hanya Untukmu Raih Tiga Penghargaan DiAjang Marketing Excellence Awards Indonesia 2022",
    "link": "https://kopikenangan.com/news/kopi-kenangan-hanya-untukmu-raih-tiga-penghargaan-diajang-marketing-excellence-awards-indonesia-2022",
    "date": "12/14/22",
    "author": "Marketing Creative",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/5fa1095912d2fc6dfc63ac9c/1671005852442-CPVAWVFFI7JJFXB9GVU4/KKHU+di+Marketing+Excellence+Awards+2022.JPG",
    "content": "Kolaborasi Kopi Kenangan Hanya Untukmu dengan Karafuru dalam menyambut hari Kemerdekaan Republik Indonesia melalui delapan Pejuang Masa Kini mendapatkan tiga penghargaan\nDalam menyambut hari Kemerdekaan Republik Indonesia bulan Agustus lalu, Kopi Kenangan Hanya Untukmu (KKHU), brand produk ready-to-drink (RTD) dari Kenangan Brands, berkolaborasi dengan NFT Artist terkemuka asal Indonesia, Karafuru. Kolaborasi yang bertujuan untuk menyoroti para Pejuang Masa Kini berhasil meraih tiga kategori penghargaan dari total 32 kategori di ajang Marketing Exellence Awards 2022 yang diselenggarakan oleh Marketing Interactive. Adapun jenis medali dari tiga kategori penghargaan yang diraih melalui kampanye Pejuang Masa Kini antara lain: (1) Medali Perak untuk kategori Excellence in Brand Strategy; (2) Medali Perunggu untuk Excellence in Content Marketing; dan (3) Medali Perunggu untuk Excellence in Launch/re-launch Marketing. \n\nThomas Dosy, Direktur Utama PT Bumi Cipta Rasa mengatakan bahwa kampanye ini berangkat dari perusahaan melihat banyaknya pejuang di kehidupan masa kini yang tidak kalah penting untuk disorot. “Banyak sekali orang di luar sana yang berjuang setiap harinya untuk hidup mereka dan itu termasuk kita semua. Dari gagasan inilah kami ingin menyebarkan semangat positif, sekaligus merayakan HUT RI 2022, untuk mengapresiasi para Pejuang Masa Kini. Melalui penghargaan ini, kami percaya pesan yang disampaikan melalui kemasan edisi terbatas KKHU sudah tersampaikan dengan baik, yaitu jangan patah semangat untuk kita dan kalian semua yang terus berjuang,” terang Thomas. \nKeberhasilan Kopi Kenangan Hanya Untukmu bersama Karafuru sehingga berhasil meraih tiga penghargaan dikarenakan kolaborasi ini berhasil memenuhi beberapa kriteria penilaian dan ketentuan yang berlaku pada kategori yang diikutsertakan. Pada kategori Excellence in Brand Strategy, KKHU secara brand berhasil membuat strategi yang baik dan ini tercermin dari strategi pemasaran yang membuat pesan kampanye Pejuang Masa Kini diterima oleh publik dengan baik. Pada kategori Excellence in Content Marketing, KKHU berhasil menjadi brand  yang dapat mendefinisikan misi dan tujuan kampanye Pejuang Masa Kini melalui konten media sosial dan media yang menyasar sesuai dengan target audiens. Terakhir, untuk kategori Excellence in Launch/re-launch Marketing, KKHU membuktikan bahwa strategi pemasaran yang dilakukan berhasil mendukung peluncuran produk kolaborasi tersebut. \n\nKolaborasi KKHU dengan Karafuru dalam kampanye Pejuang Masa Kini diluncurkan pada 17 Agustus 2022 lalu. Dengan tagar #HanyaUntukmuIndonesia, KKHU dan Karafuru berkolaborasi mengangkat delapan Pejuang Masa Kini, yang terdiri dari: Pejuang Deadline, Pejuang Masa Depan, Pejuang Sporty, Pejuang Push Rank, Pejuang Content, Pejuang Musik, Pejuang ‘Pakeet~’ dan Pejuang Get Well Soon, yang direalisasikan dalam 8 (delapan) desain kemasan KKHU edisi terbatas. “Terima kasih kepada seluruh pihak yang bekerja dan mendukung kami dalam merancang kampanye 'Pejuang Masa Kini', yaitu Karafuru, ADA Asia, dan seluruh pelanggan setia yang terus mendukung kami. Ke depannya, kami berharap KKHU dapat terus membuat kampanye pemasaran yang relevan dengan karakter konsumen kami dan juga sesuai dengan tujuan bisnis Kenangan Brands,” tutup Susan Ernawati, Head of Marketing PT Bumi Cipta Rasa. \n\nMarketing Excellence Award 2022\nMarketing Excellence Awards adalah ajang penghargaan tahunan yang diselenggarakan oleh Marketing Interactive, untuk mengapresiasi seluruh spektrum komunikasi pemasaran dari brand melalui kegiatan pemasaran yang dikurasi secara mendalam. Tahun ini, terdapat lebih dari 50 brand yang tersebar di 32 kategori dan kinerja pemasaran mereka dinilai oleh 17 juri yang berasal dari berbagai brand terkemuka di Indonesia. Penilaian ini juga didasarkan atas 4 (empat) parameter yaitu problem, solution, delivery, dan performance dari setiap aktivitas pemasaran yang dilakukan oleh brand."
  },
  {
    "title": "Selamat Bergabung Dalam Kenangan Brands, Flip Burger!",
    "link": "https://kopikenangan.com/news/selamat-bergabung-dalam-kenangan-brands-flip-burger",
    "date": "11/29/22",
    "author": "Marketing Creative",
    "imageUrl": "https://images.squarespace-cdn.com/content/v1/5fa1095912d2fc6dfc63ac9c/1669719862181-BX1A2DG2V63CYFHXTT36/DSC08084.jpg",
    "content": "Setelah sukses berkolaborasi, Flip Burger kini resmi berada dalam naungan Kenangan Brands\nBerangkat dari kolaborasi strategis yang dilakukan sejak Oktober 2022 antara Chigo, jaringan restoran non-waralaba yang berada dalam naungan Kenangan Brands, dan Flip Burger, salah satu pionir jaringan burger lokal Indonesia, Flip Burger kini secara resmi bergabung dengan Kenangan Brands. Pada saat berlangsungnya kolaborasi ‘Chigo x Flip’, Kenangan Brands menyadari bahwa kombinasi produk andalan dari kedua brand ini saling melengkapi pilihan menu yang diinginkan konsumen Indonesia. Hal ini terbukti dari Chigo x Flip yang mampu menjual hampir 28.000 burger dalam bulan pertama setelah kolaborasi. Melihat antusiasme ini, Kenangan Brands mengambil langkah bisnis untuk menggabungkan Flip Burger dengan Chigo secara resmi, menjadi ‘Chigo x Flip’. Kenangan Brands juga menargetkan untuk menyediakan menu burger di 90% gerai Chigo di Jabodetabek pada kuartal pertama tahun 2023.\n“Kenangan Brands bersama Chef Afit dan Co-Founder Flip Burger memulai kolaborasi ini dengan visi yang sama, yaitu untuk memajukan industri F&B lokal di Indonesia. Dengan bergabungnya Flip Burger dalam Kenangan Brands, kami akan terus secara konsisten menghadirkan variasi burger dengan juicy beef patty berkualitas tinggi yang dipadu dengan brioche bun yang lembut, seperti dalam menu ikonik “Smackers” dan berbagai menu burger lainnya secara bertahap di seluruh jaringan gerai Chigo yang tersebar di Jabodetabek,” kata Edward Tirtanata, CEO and Co-Founder Kenangan Brands. Ia melanjutkan, “Kami juga berharap Chigo, yang kini bertransformasi menjadi Chigo x Flip, dapat memiliki lebih banyak pilihan menu, sehingga Kenangan Brands dapat memenuhi ‘cravings’ dari para konsumen akan makanan lokal berkualitas.” \nMelihat adanya kesamaan karakter antara konsumen Chigo dan Flip Burger, yaitu kelompok generasi Z dan Milenial yang menyukai kuliner dari brand lokal serta mengikuti tren makanan, Kenangan Brands berharap kehadiran Chigo x Flip, dapat memenuhi keinginan mereka yang ingin menikmati menu burger dan ayam goreng secara bersamaan. Terlebih lagi, Flip Burger juga memiliki DNA yang sama dengan Chigo, yaitu menggunakan bahan dasar pilihan yang berkualitas tinggi. “Di samping mengeluarkan menu-menu yang sesuai dengan selera masyarakat Indonesia, strategi kami adalah selalu memastikan produk Flip Burger menggunakan bahan-bahan berkualitas tinggi, dan hal inilah yang menjadi salah satu pendorong keberhasilan Flip Burger hingga menjadi seperti sekarang,” kata Chef Afit, Co-Founder Flip Burger.\nSebagai informasi tambahan, saat ini Chigo memiliki 76 gerai yang tersebar di Jabodetabek dan Medan. “Ke depannya, kami akan memperluas ketersediaan menu Flip Burger di seluruh gerai Chigo, dan melakukan perkembangan serta inovasi secara bertahap bersama Chef Afit untuk menambah menu-menu baru di Chigo x Flip. Kami berharap bergabungnya Flip Burger dalam Kenangan Brands dapat menambah pilihan menu makanan bagi para pelanggan setia Chigo.” tutup James Prananto, CBO and Co-Founder Kenangan Brands."
  }
]